[{"timestamp":"3/20/2013 10:24:45","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What are a couple of words that your current coworkers would use to describe you?\nHow would you assist faculty research in this position?\nWhat subject areas do you think you could contribute to as a college liaison?\nWhat type of professional service do you/would you participate in?","whatquestionsdidyouasktheinterviewers":"What supervisory traits do you most hope for in a manager/department head?\nWhat was the last departmental reorganization in the library/ what is the next?\nWhat was the last new service offered in the library?","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Access Services","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"If you tend to answer questions very concisely, remember to elaborate, expanding on your answers gives others a better chance of understanding them.  This is true especially when you are going after a job that requires expertise not duplicated in the rest of the library.","rowNumber":1},{"timestamp":"3/12/2013 8:27:34","whatkindofinterviewwasit":"have had all of above","whatlevelinterviewwasit":"again, all of above","whatquestionsdidtheyaskyou":"What is your philosophy of librarianship?\n\nDescribe your management style?\n\nWhere do you see yourself in five years?\n\nDid you post on your social media that you were interviewing here?\n\nWhat particular skills / experience can you bring that other applicants may not have?\n\n\n\n","whatquestionsdidyouasktheinterviewers":"What are the biggest opportunities and what are the biggest challenges that you see in the immediate and long range?\n\nHow much staff turnover has there been in the last three years\n\nHow would you describe the community's opinion of the library\n\nHow would you describe the funding agencies support / opinion of the library\n\nWhat are your top two priorities","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Administration","whereareyou":"Applied in multiple locations","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"One location had interview that lasted for two days and involved meeting with board members and different staff groups - all of whom had different questions.\n\nOne location had interview that included giving a speech on library philosophy to staff and board members.\n\nWhen there is a stated range, you will most like need to count on starting at the bottom of the range - despite experience.\n\n","rowNumber":2},{"timestamp":"3/13/2013 11:14:11","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Third round","whatquestionsdidtheyaskyou":"Tell us about a good book you've read recently?\nTell us what your dream library building would look like?\n","whatquestionsdidyouasktheinterviewers":"What are the major projects coming up at the library?\nWhat skills and personality traits do you think the person who gets this job should have?","whatpositionlevelwasitfor":"Director/Dean","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Administration","whereareyou":"Midwestern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":3},{"timestamp":"3/12/2013 7:16:17","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Role of technology in today's urban libraries?\nPatron asks for a book on art-- how do you respond? \nHow do you stay current in your field? \n\n*a packet of questions was provided 15 min. before the interview","whatquestionsdidyouasktheinterviewers":"What was the greatest accomplishment or strength of the last person in this position? \nWhere do you see your department going in the next 5-10 years? ","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":4},{"timestamp":"3/13/2013 15:14:35","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"Building a list/Initial screen","whatquestionsdidtheyaskyou":"If an alien space ship landed in your backyard today and the aliens wanted to take you away with them, would you go?  Why or why not?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services","whereareyou":"Western US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":5},{"timestamp":"3/13/2013 18:34:17","whatkindofinterviewwasit":"supplemental application questions","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"While this wasn't a librarian interview, it was one where I leveraged my library honed transferable skills.\n\nSince it was with Bankers' Life Insurance and I was interviewing for an agent or manager position.\n\nThere was an informational group meeting first with 4 attendees.  One arrived late.  No one but me took notes.\n\n2 of us were called back.  I was selected for my potential to train other agents based on my transferable skills.  I was not asked questions so much as I asked questions:  Why did you select me for further discussion?  Why was the opening available?  Will my concerns about work/life balance be a good match for the Company?  Will I need to interview with any other staff members?  With whom will I work most closely?","whatquestionsdidyouasktheinterviewers":"See above.\n\nObviously I didn't read all the directions first.  Rookie mistake...","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"","jobfocuswascheckallthatapply":"Adult Services","whereareyou":"TN","whereareyou_2":"/rural","anyothercommentsformeorforyourfellowjobhunters":"It was interesting that the paperwork I presented was sufficient to begin the discussion.\n\nI recently also interviewed for a high school English teaching position, but the Head of the Human Resource Department told me there would be at least one open Library position that she'd like to talk to me about when it came open soon for the next school year.  It's elementary, for which I'm not prepared, but there may also be one at the high school similar to what I did in my last post for 21+ years.\n\nLinkedIn has been helpful in the job search, but nothing within driving distance has been posted.  TN does not have a central database of potential employees like PA does, which makes job hunting more demanding as each school/district must be monitored for openings.  \n\nI just missed applying for a really local high school librarian job as I was not notified of my non renewal in time to apply.  Bummer...\n\nPlease contact me at mmpatterson@hotmail.com if you need further details for your survey.","rowNumber":6},{"timestamp":"3/14/2013 6:38:22","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Application","whatquestionsdidtheyaskyou":"Do you have a Facebook account","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services","whereareyou":"Midwestern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":7},{"timestamp":"6/12/2013 12:01:43","whatkindofinterviewwasit":"Supplemental application questions","whatlevelinterviewwasit":"Application","whatquestionsdidtheyaskyou":"Question 1 Describe your experience using technology and assisting people with technology in  any setting. \n\nQuestion 2 Briefly describe your last visit to a museum. Share three things that had the most impact for you and how libraries could benefit from them. \n\nQuestion 3 In your opinion, what should the _____________ Library’s top three materials selection criteria for adult materials be? Why did you choose these three? \n\nQuestion 4 Describe your customer service philosophy. Form your answer as a Tweet.","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":8},{"timestamp":"6/12/2013 12:04:14","whatkindofinterviewwasit":"Supplemental application questions","whatlevelinterviewwasit":"Application","whatquestionsdidtheyaskyou":"Question 1 Do you have at least three years of professional library experience with at least two of those years in adult services? \n\nQuestion 2 Describe the coursework and/or experience you have had in using library technology. \n\nQuestion 3 Describe what skills and/or personal qualities you possess which will enhance your work as an adult services librarian.\n\nQuestion 4 Why you want to be an adult librarian? \n\nQuestion 5 Describe your vision of excellent public library service.","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":9},{"timestamp":"3/11/2013 13:16:18","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What did you find out about our organization?\nWhy should I pick you over all other applicants?\n","whatquestionsdidyouasktheinterviewers":"What was our favorite part of our job?\nWhat part of our job could we live without?","whatpositionlevelwasitfor":"Assistant Director","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Cataloging/Technical Services, Children’s Services, Instruction, Outreach, Reference, Teen Services, Web Services","whereareyou":"Southern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":10},{"timestamp":"3/14/2013 9:41:10","whatkindofinterviewwasit":"Supplemental application questions","whatlevelinterviewwasit":"Application","whatquestionsdidtheyaskyou":"1) List and describe databases and online catalogs used for reference in a library setting, describe various activities the databases were used for.\n\n2) describe a project you participated in that helped to promote information literacy.\n\n3) Describe how you kept appraised of trends in digital libraries or other technical changes in the field.\n\n4) what experience in evaluating materials for library collections do you have? Include a descriptive process you have taken to evaluate and determine what materials to add or keep in collection.\n\n5) Describe any experience in researching, compiling, or developing education resources for early childhood education programs, birth - 5 years.\n\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"Adult Services, Cataloging/Technical Services, Children’s Services, Liaison, Outreach, Programming, Reference","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":11},{"timestamp":"3/13/2013 18:52:19","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Third round","whatquestionsdidtheyaskyou":"How do you handle working with researchers of all ages, from grade school through post-doctoral researchers?\n\nWhat do you do if you need to help a researcher with a subject you know little to nothing about?","whatquestionsdidyouasktheinterviewers":"Further ideas and explanations of their vision for the future of the library/archives, especially since the larger organization just went through a reorganization and the previous information professional had been there over 20 years?","whatpositionlevelwasitfor":"Books and Manuscripts Curator","whattypeoforganization":"Museum Library","jobfocuswascheckallthatapply":"Adult Services, Cataloging/Technical Services, Children’s Services, Liaison, Outreach, Reference","whereareyou":"Midwestern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":12},{"timestamp":"7/26/2013 19:34:01","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Have you visited the library, and what did you think of it?\nWhat is your experience with Milennium?\nWhat do you think of the PLS consortium?  Positive or negative?\nWhat did you do when you had a patron who repeatedly refused to obey library policy?\nWhat was the most difficult computer help you were asked to provide?\nWhat is an example of your best customer service experience?\nIs there anything more you'd like us to know, or to ask us?","whatquestionsdidyouasktheinterviewers":"Is there ILL in your system?\nHow much children's work is involved with this job--will I be able to participate in storytimes?\nDo you actually offer cable storytimes?  \nWhat is your timetable for decision making?","whatpositionlevelwasitfor":"Temporary Librarian I/II","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Cataloging/Technical Services, Children’s Services, Outreach, Programming, Reference","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"Visit the library to which you are applying so you can answer yes to the first question!!!","rowNumber":13},{"timestamp":"7/9/2013 5:32:21","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"- Tell me about yourself and your history in libraries.\n- What is your greatest strength?\n- What is your greatest weakness?\n- It says on your resume that you've been in charge of creating monthly/quarterly/yearly reports. Tell me about that. \n- Have you ever supervised or trained anyone before?\n- Tell me about your experience in cataloging and what software you've used.\n- Would you be comfortable physically walking to other parts of the prison to deliver books to inmates who can't travel to the library?\n- Have you ever been in charge of a budget or purchasing?\n- Have you ever been to a correctional facility before?\n- Have you ever heard of a program called Winnebago?\n- If you were hired for the position today, how much time would you need to move here from your current location and when would you be able to start?","whatquestionsdidyouasktheinterviewers":" - Tell me more about the Librarian Certificate II and what training or preparation I might need for that. \n- Can you tell me about the inmate clerks and what my role as a supervisor would be?\n-  Can you describe the technology avaiable to me and to the inmates? \n- What types of databases does the prison have access to?\n- What is the next step, and when should I expect to hear from you?","whatpositionlevelwasitfor":"Corrections Librarian","whattypeoforganization":"Corrections Library","jobfocuswascheckallthatapply":"Adult Services, Cataloging/Technical Services, Corrections ","whereareyou":"I am in Northeast US, the job is in the Midwestern US.","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"We also discussed the type of contract, the benefits and expected salary range dependent on education and experience, as well as training opportunities and the layout of the facility. ","rowNumber":14},{"timestamp":"8/12/2013 8:08:38","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"How does this position fit into your professional goals?\nThe librarian in this position will provide considerable leadership at the library, but will lead through example and collaboration rather than having any people report directly to him or her. Given these circumstances, what are your thoughts on how to be a successful leader?\nThis is a 25-hour-a-week position with multiple responsibilities ranging from serving on the circulation desk to processing donations to materials selection. What skills will you utilize to ensure that everything gets done well and on time?\nWithin the library profession, there are those who say that \"Reference is dead.\" Do you agree or disagree? What is the value of reference services in a small library?\nIt's a quiet Sunday afternoon at the library. All of a sudden, a patron rushes to the desk to say that a toilet is overflowing. You immediately go to check it out, and sure enough, water is starting to flow out of the bathroom and into the children's area. A little girl outside the bathroom starts to scream. What would your next steps be?\nDescribe a project you worked on that involved collaborating with community leaders or outside organizations. What went well and what didn't? What did you learn about partnering with other organizations?\nHypothetical situation: As the new librarian, you've identified a much-needed change to the organization or management of an area of the collection that you know some of the longtime staff will strongly disagree with. How would you approach making the needed change?\nOne of the major responsibilities of this position will be ongoing development of the adult nonfiction collection (print and DVD). What steps would you take to understand this collection so you can successfully manage it?\nWhen you think about being a librarian, what do you like the most? And the least?","whatquestionsdidyouasktheinterviewers":"On the calendar on the library website, it looked like there were no computer classes or meetings of the book club until September (this was early July). Is the library usually slower in the summer?\nAre there any adult programs for Summer Reading?\nThe defeat of the plans to build a new library was a big blow. But if you were to do a SWOT analysis, what would you say are the library's greatest strengths right now?\nWhat kind of committee work would the librarian do?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Cataloging/Technical Services, Instruction, Outreach, Reference","whereareyou":"Western US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":15},{"timestamp":"5/1/2013 15:05:51","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"What can you do for my students? (departments heads were part of search committee)\nHow do you deal with stress in the workplace?\nWhy do you want to leave your current job?\nHow do you feel about for profit institutions?\nHow familiar are you with legal work/research?\nDo you know APA?","whatquestionsdidyouasktheinterviewers":"What databases do you use?\nHow many students do you have?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"For Profit","jobfocuswascheckallthatapply":"Adult Services, Cataloging/Technical Services, Instruction, Outreach, Reference, Generalist","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"Contrary to popular opinion, not all for profit schools have bad libraries or bad librarians.  Be cautious and skeptical approaching them but don't discount them all on principle as a potential place to work.  ","rowNumber":16},{"timestamp":"3/11/2013 12:58:47","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Tell me about your professional background.\nWhat makes you angry? \nWhy are you looking to move on from your current job?\nWhat would your supervisor say are your strengths and weaknesses?","whatquestionsdidyouasktheinterviewers":"What are the biggest challenges this person will face?\nWhat separates the good from the great?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Adult Services, Cataloging/Technical Services, Instruction, Reference","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":17},{"timestamp":"3/11/2013 15:20:54","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Cataloging/Technical Services, Outreach, Programming","whereareyou":"Midwestern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":18},{"timestamp":"4/18/2013 10:30:09","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Give an example of resolving a conflict  with a co-worker, or dealing with a difficult patron.\n\nWhat is your experience with supervising staff?\n\nHave you had any experience recruiting volunteers?","whatquestionsdidyouasktheinterviewers":"What do you consider to be the best thing about this library?\nWhat did the previous person do that you liked?\nWhat would you like to see change?","whatpositionlevelwasitfor":"Branch Manager","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Instruction, Outreach, Reference, Teen Services","whereareyou":"Southern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":19},{"timestamp":"3/14/2013 3:56:35","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Name three interesting things you found out about the library why you were preparing for the interview, and say why you thought they were interesting.\nWhy do you want to work here?\nWhat sorts of things should the library be doing to prepare for the future?\nTalk about experience you have with (programming, social media, outreach).\nDiscuss the traits you like in a supervisor.\nTalk about a time you have been flexible in a work setting.\n","whatquestionsdidyouasktheinterviewers":"Why do you like working here?\n\nIf I had a new idea for a program, what would the steps be to get it implemented?\n\nI also asked a very specific question about something I saw in the news related to the library.","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Outreach, Programming, Reference, Teen Services","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":20},{"timestamp":"3/21/2013 11:53:41","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1) Have you completed any continuing education in the past 2 years?\n2) Tell us about a negative experience you had when visiting a library and why was it negative?\n3) Tell us about a positive experience in a library setting.\n4) What do you think defines teamwork?\n5) What would you do if you had an upset customer?\n6) Are you flexible/able to deal with changes?\n7) In this position, it can sometimes be busy and sometimes not at all. What would you do during down time?\n8) What do you think exemplifies great customer service?\n9) How would you handle a person displaying disruptive behavior?\n10) How would you greet someone visiting the library?\n11) Are you comfortable with technology? (They used examples like Internet, e-mail, social networking sites, etc.)\n\nThere were more questions...but I can't remember them at the moment! ","whatquestionsdidyouasktheinterviewers":"I asked what the typical schedule might look like, as this was not defined in the job description when I applied. ","whatpositionlevelwasitfor":"Library Clerk","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Outreach, Teen Services, Web Services","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"Really use the job interview as a way to network! Even if you don't get the job, sometimes you can receive great advice or learn from the people interviewing you. During my interview, I found out about another part-time opportunity I was not previously aware of! ","rowNumber":21},{"timestamp":"3/12/2013 5:22:36","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What criteria would you use for weeding nonfiction?\nIf a patron came in looking for biographical information on JK Rowling, what online resources would you recommend?\nA student comes into the library to complete a school project. What is the first online resource you would recommend. \nName some databases where you would find consumer health information.\nHow would you manage a situation in which a patron violated the library code of conduct?\nDescribe a situation in which there was an issue of miscommunication between you and a colleague. How was the situation resolved?\nDescribe two fiction books you've read recently.\nA school bus full of first grade students pulls up to the library unexpectedly. What is your go-to book in a situation like this. \nDescribe two popular YA books. \nIf you were offered this job, what would be your first priority?\nHow would you handle a situation in which a patron questioned the inclusion of a book in the collection?\nDescribe an idea for teen programming.\n","whatquestionsdidyouasktheinterviewers":"What do you like most about working in the county library system?\nIs there an opportunity for advancement?\nWhat professional development opportunities are there?\nWhen do you plan to make a decision?\nWhat sort of teen programming do you currently have?\nIn what direction would you like YA services to go?\nHow busy is the library after school?\nHow are teens currently using the library?\nWhat sort of budget is there for collection development?\n","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Programming, Teen Services","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":22},{"timestamp":"3/11/2013 13:28:22","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What did you do to prepare for this interview?\nHow would you go about recommending a book in a genre that you don't read in usually?\nWhat do you think of e-books and how comfortable are you with their technology?\nDescribe a challenge you encountered in working with the public.","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Reference","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":23},{"timestamp":"4/12/2013 6:58:44","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What action would you take if a patron requested an item that the library did not possess? \n\nHow would you respond to a mother asking for suggested reading material for her 4th grade daughter? \n\nHave you assisted a patron in downloading an e-book onto an e-reader? \n\nHow would you respond if a patron objected to a library book?","whatquestionsdidyouasktheinterviewers":"none.","whatpositionlevelwasitfor":"On-call librarian","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Reference, Teen Services","whereareyou":"Western US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":24},{"timestamp":"3/21/2013 11:18:20","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Application","whatquestionsdidtheyaskyou":"From what I remember (it was an hour long interview):\n-Describe self, including hobbies/interests\n-Describe current/previous job(s)\n-Three strongest skills\n-Biggest weakness\n-Three characteristics to describe myself\n-What I would do if I supervisor instructed me to do something I didn't agree with\n-Describe a conflict I've handled in another position\n-Describe my experience working with computers\n-Describe a supervisor I've enjoyed working for\n-Describe a supervisor I didn't enjoy working for\n-Describe my ideal work environment\n-Do I speak another language\n-My proudest accomplishment\n-What's the difference between being good and being exceptional\n-My experience working with people of all ages\n-Rate myself from 1-5, with supporting examples, on: attention to detail, ability to make decisions, working under pressure, trustworthiness/responsibility, responding to criticism, handling conflict, explaining procedures\n-Would I be comfortable supervising others, including those older than I am\n-Why did I apply for the position\n-Why should I be selected for the position","whatquestionsdidyouasktheinterviewers":"This was for a higher position at the branch where I am already employed, so I already knew the answers to my go-to questions (about the work environment, managerial style). I mimicked a question they gave me and asked how someone in this position could be an exceptional employee rather than just good.","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Reference, Teen Services, Neighborhood branch","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":25},{"timestamp":"5/1/2013 19:16:08","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"Building a list/Initial screen","whatquestionsdidtheyaskyou":"I haven't seen your resume, tell me about what experience you have that might qualify you for the job?\nWhat is your experience and comfort with children's services?\nWhat print or online resources would you use to search for information on ________ (name of a person)?\nThese are the desks we have in our main library, can you tell me what experience you have in each of these areas, and if you would be interested/comfortable working there?  It is ok to say no, we don't expect you to say yes to all.\nDo you have any subject specialties?\nWhat is your availability to work at each of the following days/times?","whatquestionsdidyouasktheinterviewers":"n/a","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Reference, Teen Services, on-call work","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":26},{"timestamp":"3/20/2013 8:59:37","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Application","whatquestionsdidtheyaskyou":"Where do you see yourself ten years fr now?\nHow do you see your place in the workings of the library?\nIf you saw a child climbing to the top of a library shelf what would you do?\nWhat books have you read in the past year?\nWhat would you do if you overheard a library worker telling a patron something that you knew was not correct about library materials or library use of materials?\n","whatquestionsdidyouasktheinterviewers":"What do you do if a parent wants you to specifically restrict what their children may borrow?\nWhat do you do if there is a patron in the building keeping other patrons from what they wish to do? ","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Reference, Web Services","whereareyou":"Midwestern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":27},{"timestamp":"3/16/2013 9:05:21","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"What do you see as the role of a youth services librarian?\n\nTell us about a book you would recommend to a teen, and why.\n\nWhat is your experience teaching technology to users?\n\nHow would you prepare for being the person in charge of the building?\n\nDescribe a library program that you'd like to introduce (or a current one that you'd like to modify) and explain the steps you would take to put it together, and the metrics you would use to measure the program's success.\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Teen Services","whereareyou":"Midwestern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":28},{"timestamp":"11/18/2013 18:45:36","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"","whatquestionsdidtheyaskyou":"How to solve a problem, a Parton was waiting to check out a book, and a Parton with a screaming kid and also the phone is ringing, while the other librarian is on a break, what would you do?","whatquestionsdidyouasktheinterviewers":"None","whatpositionlevelwasitfor":"Library Clerk","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Children’s Services, Web Services","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":29},{"timestamp":"3/12/2013 6:26:21","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What qualifications do I have, how am I different from other applicants, strengths and weaknesses. They also asked what I would do if a patron who didn't speak English came up to the desk and needed help (this was one of the toughest questions I've ever been asked).","whatquestionsdidyouasktheinterviewers":"Who would be my superior, what tasks would I perform, could I have a tour.","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Circulation","whereareyou":"Northeastern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":30},{"timestamp":"9/13/2013 23:22:53","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1. Tell us about your education and experience.\n2. Tell us about a time you were able to be creative at work.\n3. Has a supervisor ever criticized your work? Explain.\n4. What tricks or techniques do you use to make your job easier.\n5. Tell us about a time you missed an obvious solution.\n6. How do you know when you are effectively reading a person?\n7. How do you talk with/interact with customers.\n8. Have you ever not lived up to your own expectations?\n9. Do you prefer working with teams or individuals?\n10. How do you handle any difficulties in proposing changes?","whatquestionsdidyouasktheinterviewers":"Community demographics\nTypical work day/duties/responsibilities\nWhat kind of schedule\nOutreach opportunities\n","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Instruction, Outreach, Programming, Reference","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":31},{"timestamp":"3/12/2013 4:46:40","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Tell us about a successful team you were on.  What did you do to contribute to the success of the team?\n\nList your technology skill your knowledge of technology  and what skills you have.\n\nAre you familiar with ebooks? What Web 2.0 technology have you used\n\nDescribe one of your best projects. What was it? How did you go about organizing it? How did it turn out?\n\nTell us why you think this position will be important to the community?\n\nWith our transition to the new bisac system how would you explain to a patron who does not know about it and is not liking it.\n\nWhat do you see yourself contributing to this library \n\nDescribe a time when you were criticized by a peer or supervisor. What happened? How did you feel and what did you do?","whatquestionsdidyouasktheinterviewers":"To the manager or branch director - what is your preferred method of communication.\n\nHow many people have you interviewed how many applied\n\n","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Instruction, Outreach, Programming, Reference, Teen Services","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":32},{"timestamp":"9/17/2013 17:20:13","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What have I been doing since graduating (3 years) to keep up to date?  (Totally threw me for a loop, seminars and continuing Ed can be expensive, but fortunately, I have taken a few on-line freebies, which is what I said.)","whatquestionsdidyouasktheinterviewers":"I remember asking something, I just can't remember exactly what.","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Adult Services, Instruction, Reference","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"Hang in there!!  (I didn't get the job)","rowNumber":33},{"timestamp":"9/21/2013 8:11:53","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"If you could bring a book or books to a desert island what would they be?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Adult Services, Instruction, Reference","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"Only one round of interviews, job is part time/evening & every other weekend. ","rowNumber":34},{"timestamp":"3/21/2013 10:57:50","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Tell me about your background and why you wanted to be a librarian.\nTell me about your computer skills.\nWhat's your supervisory style?  Give specific examples.\nHow do you interact with students, faculty, and administration?\nHow do you prioritize projects?\nTell us about your experience working with college students.\nHow do you deal with interruptions during your workday?\nTell us about a conflict you had at work and how you handled it.\nWhat would your supervisor say are your strengths? Weaknesses?\nHow has your non-library work prepared you for library work?\nHow do you feel about living in a small, rural town?\n","whatquestionsdidyouasktheinterviewers":"Asked for more information about how much time would be spent on each type of job duty (job description lists work in circ, reference, instruction, ILL, collection development, etc).\n\nAsked for more details about what happens next (interview/hiring timeline).","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Adult Services, Instruction, Reference, Circulation, ILL","whereareyou":"Midwestern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":35},{"timestamp":"3/12/2013 4:25:49","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Third round","whatquestionsdidtheyaskyou":"Name a time when you did something wrong on the job and your supervisor had to talk to you.  Name a time when a subordinate had a problem with you and how did you deal with it.  Talk to us about your experience with budgeting.  Talk to us about your experience making partnerships with in an organization or with the community to get something done.  Tell us about your organizational skills.  ","whatquestionsdidyouasktheinterviewers":"Priorities, expectations, staff levels, goals for the branch and for the position.","whatpositionlevelwasitfor":"Branch Manager","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Outreach, Programming, Reference","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":36},{"timestamp":"3/22/2013 16:39:49","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Why do you want to work here?\nDescribe a time you dealt with an irate patron. What happened? Where you satisfied with the outcome?\nA visiting patron asks you about the library system, how do you respond?\nDescribe examples of being involved in teamwork.\nHow do you handle dealing with homeless, disabled, and foreign patrons?\nThe phone rings, a patron comes to the desk with a question, and the printer jams. What would you do in this situation?\nDo you have experience in community outreach?\nHow comfortable are you with technology? (helping patrons with ebooks, audiobooks, and computer troubleshooting, etc.)\nTell me about a conflict you had with a co-worker or supervisor. How was it resolved? Where you satisfied with the outcome?\nTell me about a time you created a system for organization.\nWhy do you want this position?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Library Technician","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Outreach, Reference","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":37},{"timestamp":"3/21/2013 7:40:51","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What have you read recently that you would recommend?\nWhat programs have you planned that were successful?\nWhat would you do if you had several patrons waiting for help and the phone was ringing?\nWhat level of oversight do you expect from your supervisors?\n","whatquestionsdidyouasktheinterviewers":"What are the upcoming issues that you see facing this library?\nWhat sorts of programs have been held here in the past?\nWhat would the schedule look like for this position?\nHow soon would you expect someone to start?","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Programming, Reference","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":38},{"timestamp":"8/27/2013 15:59:12","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"What would you do if a patron constantly bugs you about checking out an item and will not relent even after you show them the library policies?\n\nHave you ever presented in front of a library board?\n\nHow would you convince the city council that the library is an important part of the community?\n\nHow would you promote library services?\n\nHow much cataloging experience do you have?","whatquestionsdidyouasktheinterviewers":"How do you support librarians professionally?\n\nWhat would be the typical hours for this position?\n\nWhy is this position open?\n\nWhen do you expect to hire?","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Programming, Reference","whereareyou":"Western US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"Always expect unexpected questions. It's good to study general questions but also be prepared to think on your feet. For this interview, I was asked questions I had never been asked before. Be honest! In this interview, they asked about my cataloging experience and I was honest and said that I don't really catalog but that I did take a class in library school and that I would be willing to take an online course in it and that I am a quick learner. ","rowNumber":39},{"timestamp":"3/12/2013 9:10:55","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Why are you specifically interested in working at [name of library]?\nWhere do you see yourself in five years?\nAre you comfortable working with a diverse population?\nWhat experience do you have with supervisory roles?\nTell me about a reference transaction that didn't go the way you initially thought it would and how did you deal with it?\nTell me about your experience at [previous library]?\nHow comfortable are you with technology?","whatquestionsdidyouasktheinterviewers":"What are the specific requirements of the job aside from staffing the reference desk?\nWhat schedule would this person work?\nAre there any big projects coming up for the library?\nWhat's your favorite thing about working at [name of library]?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Reference","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":40},{"timestamp":"3/14/2013 9:33:19","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Which e-reading technologies are you familiar with? \nHave you ever disagreed with a library policy, and if so what have you spoken to supervisors regarding the issue? \nHow would you deal with an angry patron with unreasonable demands?\nDo you have experience with reader's advisory?","whatquestionsdidyouasktheinterviewers":"What kind of procedures do you use for collection development?\n","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Reference","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"If you're looking to get into the public library field, you most likely will have to double or triple up on the jobs and play the waiting game.","rowNumber":41},{"timestamp":"3/20/2013 21:14:05","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First and only round","whatquestionsdidtheyaskyou":"This was for an interview for a reference position in a public library.\n\n1. What are your top three information resources for use in a public library setting?\n\n2. What general and specific skills and subject background would you bring to the position?\n\n3. Thinking back on a time when you entered an established library work team, what was successful? What were the challenges? What would you do differently?\n\n4. Describe an experience you've had of a challenging work day in a library. What were you responsible for? How was it organized? How do you typically evaluate your work on a daily basis?\n\n5. What experience do you have writing for social media in a personal or professional capacity?\n\n6. What strategies would you use to answer this question? (They provided a real question which had recently been received at the reference desk.)\n\n7. Is there any other information you'd like to share to help the interview team make their decision?","whatquestionsdidyouasktheinterviewers":"1. How do you see the work of librarians (specifically, adult services librarians) at this organization changing over the next 5-10 years?\n\n2. How would you describe the culture of the reference department?\n\n3. To what extent are staff in this department involved in making decisions that directly pertain to their work? How are the ideas and input of staff conveyed to higher levels of management?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Reference","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":42},{"timestamp":"9/8/2013 12:51:23","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Building a list/Initial screen","whatquestionsdidtheyaskyou":"1. Briefly tell us about your experience  and why you are the best candidate for librarian at this library.\n2. What is a must-see television series or movie that is popular right now or will be in the near future? How would you go about building a tie-in booklist, display, and program?\n3. A customer with a small child is working on an internet computer in the adult area.  The small child is clearly beginning to get bored.  You notice that another customer is disturbed by the child being there.  What would you do?\n4. One of your supplemental questions on your application was to tweet your customer service philosophy.  You tweeted: ______; tell us more about this philosophy.\n5. Tell us about one of the most, creative, shocking, or off-the-wall library programs/events you personally have come up with.  How did you or would you ensure that your event happened and was a success?\n6. How do you pick a good book to recommend to customers?\n7. Describe a situation when your workplace priorities changed quickly.  What did you do?\n8. How do you stay connected professionally?  What resources and tools do you use?\n9. Your supervisor invites you to present at an upcoming conference of your choosing.  What topic would you talk about?  What conference would you choose to present at?\n10. How big of a deal is the weeding controversy (#bookgate) at Urbana Free Library?  Tell us what you think caused the controversy?\n11. Anything else you would like to add?  Any questions you would like to ask us?","whatquestionsdidyouasktheinterviewers":"n/a  - oral board","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Reference","whereareyou":"Western US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":43},{"timestamp":"10/14/2013 7:24:01","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What is your management style?\nHow are you with technology?\nTell me about your experience in collection development, particularly in deselection?","whatquestionsdidyouasktheinterviewers":"What do you like best about the library?\nWhat are some of the challenges with this position?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Adult Services, Reference, Collection Development","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":44},{"timestamp":"6/12/2013 7:48:17","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"A)\tHave you had a chance to read the job description for the position? If not, hand them a copy now and have them review it for a minute. \nB)\tIs there anything that would prevent you from performing the essential duties and responsibilities of this job?  If yes, ask them to explain what accommodation they would need to be able to perform this function.\n\n1.\tPlease give us a brief overview of your education and experience and tell us why you feel you are qualified for this job.\n\n\n\n\n\n\n\n2.\tWhy do you want to work here?  Why are you interested in this position?\n\n\n\n3.\tWhat unique attributes will you bring to this library?\n\n\n\n\n4.\tHow would your current supervisor describe your strengths and weaknesses?\n\n\n\n\nJOB KNOWLEDGE\n\n1.\tDo you like working with people?  \n\n\n\n2.\tCan you name 3 reference sources you would use to help a 7th grader learn about Texas history?\n\n\n\n\n3.\tWhat would you do if you were unsure of how to answer a reference question?\n\n\n\n4.\tThe role of the reference librarian and the reference department has changed a lot in the past 5 years.  How do you see reference service changing in the next 5 years?\n\n\n\n\n\n5.\tPlease describe your relevant technology experience.\n\n\n\n\n6.\tYou’ve been given $5000 to spend on science and technology materials.  How will you spend it?  How do you decide what to order?\n\n\n\n\n\n7.\tWhich 3 websites do you visit most often?\n\n\n\n\n8.\tIn the past you have been heavily focused in ___________.  How do you feel      about making the transition to adult reference services?  \n\n\n\n\n   9.   In your current or last position what have been (are) your two most significant     \n         accomplishments.\n\n\n\n10. How would you establish partnerships in the community?  \n\n\n\n\n\n11.  How do you go about providing readers’ advisory?  What tools, if any, do you use?\n\n\n\n\nCUSTOMER SERVICE\n\n\n1.\tPlease define a public service attitude.\n\n\n\n\n2.\tHow do you define going the extra mile for a customer?  Can you give me an example?\n\n\n\n\n\n3.\tWhat is the most positive aspect of dealing with library customers?  Negative?\n\n\n\n\n     4.   What innovation did you make at work that had a positive impact on the customers     \n           you served?\n\n\n\n\n     5.  Tell me about a time when you have had to juggle multiple tasks in your work.\n\n\n\n\nWORK ETHIC\n\n1.\tTell me about a time when you missed an obvious solution to a problem.  What \ndid you learn from that mistake?\n\n\n     \n\n2.\tHave you ever had difficulty with a supervisor?  How did you resolve it?\n\n\n\n\n\n3.\tWhat motivates you to go the extra mile on a project?\n\n\n\n\n4.\tIf you know your boss is 100% wrong about something, how would you handle it?\n\n\n\n\n\nTEAMWORK\n\n\n\n1.\tDo you work better by yourself or as a part of a team?\n\n\n\n2.\tWhat are the characteristics of a successful team?\n\n\n\n\n3.\tHave you ever worked with someone that you considered difficult?  How did you\nhandle it?\n\n\n\n\n4.\tWhat can a coworker do to affect your enthusiasm for your job?\n","whatquestionsdidyouasktheinterviewers":"So so many. Insurance. What their plan for this position was. Why it was vacant. What are the challenges of this position. \n\nI should have asked if they were on a pay freeze. \n\nThey laughed when I opened my notes to my questions, but at the end said that I interviewed them as much as they interviewed me, which they said was good. ","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Adult Services, Web Services","whereareyou":"Southern US","whereareyou_2":"a suburb of a LARGE metro area","anyothercommentsformeorforyourfellowjobhunters":"Got the job. Ultimately, don't think it's a good fit and will commence looking in a few weeks. ","rowNumber":45},{"timestamp":"3/18/2013 7:54:49","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Third round","whatquestionsdidtheyaskyou":"What do you love and hate about being a librarian?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Business researcher","whattypeoforganization":"Special Library","jobfocuswascheckallthatapply":"business development","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":46},{"timestamp":"3/11/2013 12:51:32","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Have you ever had a great supervisor? What made them great?\n\nHow can you tell when you are under stress? What do you then do about it?\n\nWhat motivates you?\n\nHave you ever had to enforce an unpopular policy that you didn't personally care for? Elaborate.\n\n","whatquestionsdidyouasktheinterviewers":"Reason for position coming open.","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Special Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Midwestern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":47},{"timestamp":"3/11/2013 12:57:08","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What is your management style?\nHow would you like to be managed?\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":48},{"timestamp":"3/11/2013 13:03:09","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"How do you keep abreast developments in the field of cataloging, namely RDA training (for an interviewee coming from a part-time job where training would not be provided)?\n\nWhat do you read (professionally) and what professional events do you attend?","whatquestionsdidyouasktheinterviewers":"What are your expectations of this position besides the description provided in the ad? How do you envision successful candidate's contributions to the department and the institution?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Northeastern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":49},{"timestamp":"3/11/2013 13:12:33","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"How would I feel about cataloging items that I found objectionable or offensive?\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":50},{"timestamp":"3/11/2013 14:44:06","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What kind of experience do you have with collection development?\nHow do you determine what to buy?\nWhat experience do you have with project management and can you describe a project you oversaw?\nHow much experience do you have working with an ILS?\nWhat kind of experience do you have with budgeting?\nWhat experience do you have with contract and vendor management?","whatquestionsdidyouasktheinterviewers":"What are the funding sources for the library collection? How stable are they? \nWhat is the current collection development procedure? \nWhat vendors do you use?\nWhat ILS do you run? \n","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":51},{"timestamp":"3/12/2013 6:09:23","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"Application","whatquestionsdidtheyaskyou":"How do you deal with difficult people?\nWhat is your experience comparing vendor services (for acquisitions, but also for electronic resources)?\nDescribe your experience with a particular ILS. \nWhat are the emerging trends in [this area]?\n","whatquestionsdidyouasktheinterviewers":"Is this a new position or an existing position?\nWhat do you see as the initial challenges or priorities of the person who is hired for this position?\nFor academia, is this a faculty, tenure-track position or professional staff position?\nIs there support for professional development?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Southern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"Practice and prepare! Know how you are going to answer the standard questions, then make up some really hard questions for yourself, and prepare those answers as well. Do your research - know the organizations strategic plan and any recent events. ","rowNumber":52},{"timestamp":"3/12/2013 8:28:31","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"Describe your experience in Collection Development\nList awards/scholarships/grants/honors you have received.\nTalk about your experience with Authority records\nDescribe your experience in Cataloging\nWhat library 2.0 tools are your familiar with?\nDiscuss your interactions with other staff and faculty regarding the library.","whatquestionsdidyouasktheinterviewers":"What are some of the up-coming projects or changes occurring at your library?\nIf there is one particular skill set you are looking for, what would it be?\nWhere do you see the importance of cataloging in the future of this library?\nWhat are the research expectations of the faculty here?\n","whatpositionlevelwasitfor":"Assistant librarian (entry/professional)","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Southern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"Experience was the main thing.  Describe your experience in....","rowNumber":53},{"timestamp":"3/12/2013 19:57:15","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Third round","whatquestionsdidtheyaskyou":"What projects did I work on while in school?\nWhat attracted you to the job?","whatquestionsdidyouasktheinterviewers":"How many hours will I be working?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Northeastern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"I got my job cataloging a special collection because of my knowledge of Hebrew. You need to separate yourself from the crowd!","rowNumber":54},{"timestamp":"3/15/2013 6:24:37","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"what vendors have you worked with?\nwhat qualifies you for this position?\nhow do you deal with conflict? give an example.\nwhat software are you familiar with?\nPublication is required for tenure.  What are your research interests? \n","whatquestionsdidyouasktheinterviewers":"How involved would I be in the institutional repository?\nAre ebooks managed by acquisitions or e-resources?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":55},{"timestamp":"3/18/2013 7:54:09","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What relevant experience do you have? How familiar are you with Archivist's Toolkit, RDA, and other cataloging methods? Do you have any education not listed that might be relevant to this project? Are you familiar with this institution and its mission? ","whatquestionsdidyouasktheinterviewers":"What's a comparable cataloging project this department has worked on or completed? What methods did the department discover or implement as a result? What kinds of materials would the candidate encounter? Would there be any on-the-job training? What's the department community like? Are there quotas?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Archives","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Midwestern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":56},{"timestamp":"3/28/2013 6:55:26","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"A sampling:\n\nWhy do you want this job?\n\nWhat separates you from other candidates?\n\nWhy do you think you are a good fit for our library?\n\nWhat type of environment do you enjoy working in?\n\nWhat is an example of a miscommunication between you and a patron?\n\nTell me about a time you had a problem with a patron or a coworker.\n\nWhat is the most recent book you've read?\n\nWhat are some of the ways you use technology?\n\nTell me what you would do if a patron refused to adhere to library policy.\n\nIs there anything else you'd like us to know?","whatquestionsdidyouasktheinterviewers":"Is the job permanent?\n\nHow many other staff members work here?\n\nWhat kind of training will take place?\n\nWhat secondary roles might I play?\n\nWhat types of professional development oppy's will there be?\n\nWill I be working just at this branch or at other ones, too?","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"Some advice I try to follow:\n\nKeep answers short and direct.\n\nHave good posture and limit hand / head movements.\n\nExplain how your experiences relate specifically to the job.","rowNumber":57},{"timestamp":"4/3/2013 11:50:23","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Describe what being a good team member means to you.\nWhy do you believe you are qualified for this position?\nDescribe a situation where you had to learn something quickly.\nPlease provide a few examples of work accomplishments that have given you the most satisfaction.\nWith which aspects of this position are you most confident?\n","whatquestionsdidyouasktheinterviewers":"What is your favorite thing about working at this library?\nWhat is the institution's approach to supporting professional development?\nHow is the library viewed by the students and faculty?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"I took every bullet point in the job description and reviewed my resume to create examples for potential scenario questions.  I wasn't asked too many scenario questions in this interview, but in the past I was woefully unprepared for an interview that consisted of nothing but scenario questions.  Better to be way over-prepared than caught off guard!\nGood luck to everyone who is job hunting in this tough job market.  If you aren't having any luck in the traditional library job market, take a look an nonprofit jobs.  In my experience nonprofit organizations are very happy to have MLIS and information professionals apply for their positions.  Not to mention you might qualify for loan forgiveness after 10 years of employment in the nonprofit sector.  ","rowNumber":58},{"timestamp":"4/5/2013 9:00:00","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"How do you want this (entry level) position to challenge you?\n\nWhat do you look for in a supervisor?","whatquestionsdidyouasktheinterviewers":"What is the turnover for this position?\n\nWhat is the compensation","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"This was an HR level interview - the interviewer was thorough in answering any questions I might have had about how well the department got along/job turnover/compensation etc...","rowNumber":59},{"timestamp":"4/19/2013 9:49:23","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"Why would you considering taking such a large pay cut?","whatquestionsdidyouasktheinterviewers":"What are the biggest challenges facing your section?\nWhat are you doing about RDA?","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Government","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"I am finding that with over 10 years of library experience a lot of federal agencies in Washington, D.C. will not even offer a professional applying for a paraprofessional an interview--even when they make the referral list.","rowNumber":60},{"timestamp":"5/1/2013 14:45:46","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Why did you apply for this position?\nAre you comfortable using RDA?\nWhat do you find most challenging about cataloging?\nWhat do you find most challenging about archives work?\nDo you have any experience with outreach?\nWhat systems/software/standards have you used?\nAre you familiar with institutional repositories?\nWhat kinds of exhibits have you done?\nDo you have experience with authority files?\nWhat kinds of materials have you cataloged?\n","whatquestionsdidyouasktheinterviewers":"Have you ever employed an archivist before?  What is the current condition of your archival collections?\nSince librarians at your institution are considered faculty, are you evaluated by research/paper writing or more by professional development?\nWhat kinds of collections do you house that aren't listed on your website?  Do you have an acquisitions policy?\nHow will my responsibilities overlap with other cataloging staff?\nWill I need to catalog government records or is that covered by a specialist?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":61},{"timestamp":"5/9/2013 14:25:35","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Describe a long term project you have participated in.\nWhat element of RDA are you the most excited about?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Northeastern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":62},{"timestamp":"7/15/2013 5:45:48","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What do you see as the greatest challenge to public libraries today?","whatquestionsdidyouasktheinterviewers":"How did this position become available?","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":63},{"timestamp":"8/12/2013 7:25:19","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"only round","whatquestionsdidtheyaskyou":"Most of it was the standard like what do you like to read...how would you handle a hectic situation...have you supervised anyone?\nTell me about **** project you are working on now.\nTell me about *** library you worked.\nDo you program?\nTell me about a time you helped someone use a computer.","whatquestionsdidyouasktheinterviewers":"Is the server backed up and are those tapes stored off site?\nWhat does the catalog do from 3-6am every day?\nHow do you expect after hours problems with the server be handled?\nHow stable is the cooperative's funding?\nIs there an acquisitions module that is used?\nWhat operating system are the public computers using? (Everyone seems to still use Windows XP even tho' MS is ending its life next spring)\nWhat is your favorite part of your job? What part could you do without?","whatpositionlevelwasitfor":"Senior Librarian","whattypeoforganization":"library cooperative","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Southern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"Don't be afraid to relocate, even far-far away, to find that dream job.","rowNumber":64},{"timestamp":"9/2/2013 11:34:14","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"\"Why do you want to work at this institution?\"\n\"What would you do when you first get here?\"\n\"Tell me about your interactions with the faculty at your prior position.\"","whatquestionsdidyouasktheinterviewers":"\"What do you think the library's strength is?\"\n\"Can you tell me about some of the services and resources you supply to students to fulfill your library's mission?\" This question was tailored to the mission statement, but altered for privacy.","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":65},{"timestamp":"3/12/2013 5:54:09","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Name top 3 YA authors popular with Middle School Students today.\nHow do you see your role in the school?\nHow will you work with classroom teachers?\nWhat sort of environment do you see the Media Center being?","whatquestionsdidyouasktheinterviewers":"What type of scheduling (fixed or flexible)?\nWhat additional duties outside of Media Center duties are assigned?\nIs the Media Clerk full-time to the Media Center or shared?\nWhat level of involvement in decision making for budget dollars does the Media Specialist have?","whatpositionlevelwasitfor":"Library, Media and Technology Specialist","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Children’s Services, Instruction, Liaison, Outreach, Programming, Reference, Teen Services, Web Services","whereareyou":"Southern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"It is all about marketing yourself!  You can talk about the great things you have done by wrapping them around what you would foresee yourself doing in their setting.","rowNumber":66},{"timestamp":"10/8/2013 12:49:10","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1. Why am I motivated to succeed as a consulting librarian?\n\n2. What is my process for discovering new tools, learning, and adopting them?\n\n3. Describe campus and work collaborations, who I worked with, and types of projects.\n\n4. What is my teaching philosophy and approach to instruction?\n\n5. What kind of assessment activities have I participated in?\n\n6. What is the role of data in my work?","whatquestionsdidyouasktheinterviewers":"1. What instructional formats will the candidate be working with? One-shot, semester-long, or asynchronous?\n\n2. Can you describe a typical day for this position?\n\n3. What is the team’s communication style?\n\n4. What would success in 12 months look like?\n\n5. What opportunities are available for professional development?\n\n6. What is the time frame of the search and what are the next steps?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Instruction, Outreach, Reference","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":67},{"timestamp":"4/20/2013 17:59:36","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1. What areas of librarianship interest you the most?\n2. What recent project are you most proud of?\n3. What do you look for in a manager?\n4. How would a former manager describe you?","whatquestionsdidyouasktheinterviewers":"What are some challenges you've faced with people in this position before (it was for an entry level position and there are usually six at any given time)?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Government library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Instruction, Reference","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":68},{"timestamp":"4/1/2013 8:07:35","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Why did I apply for this job?\nWhere do I see myself in 5-10 years?\nWhat experience do I have with Access databases and SQL?\nAm I comfortable enough with HTML to edit and update the department website?\nThey also went over the general requirements of the job and asked if I had experience with them.","whatquestionsdidyouasktheinterviewers":"Did this position entail answering OPRA requests?\nHas there been a big push toward digitizing and making public the historic resources at the library? \nHow much room for advancement is there in this library?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Special Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Law, Reference, Research","whereareyou":"Northeastern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"Only 12-14 people got first-round interviews (about 10% of applicants). There will be a second round of interviews in about 2 weeks. I will be informed of the status of my application whether or not I get selected for a second round interview.","rowNumber":69},{"timestamp":"3/15/2013 3:14:14","whatkindofinterviewwasit":"Supplemental application questions","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Outreach","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":70},{"timestamp":"3/11/2013 13:10:28","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Senior Librarian","whattypeoforganization":"Special Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Outreach, Web Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":71},{"timestamp":"3/12/2013 6:32:25","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Special Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Outreach, Web Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"Just remember, that most interviews are formalities.  The job is already set for an insider and the opening was advertised for legal reasons.  With that in mind, have fun in the interview and let it all hang out.  You have nothing to lose, because you have nothing to gain.","rowNumber":72},{"timestamp":"3/12/2013 8:31:36","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Tell us why you're a good fit for this position and this institution. Tell us about a digital project in which you've been involved (challenges and successes). What non-traditional services (i.e. not metadata and digitization) do you believe librarians can provide digital humanists? How would you go about performing QC/QA for digital materials? How comfortable are you with evaluating copyright status for special collections materials?","whatquestionsdidyouasktheinterviewers":"What did you find most exciting and most challenging about inaugurating the position of scholarly communications librarian? [Asked of someone on the search committee who had launched a newly created position like the position for which I was interviewing] Tell me about the organizational decision-making process for moving to open-source for many library technology services. [Because the position I was interviewing for was about developing a new program, I wanted to gain insight into how change happens at this institution.]","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Outreach, Web Services","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"This position was a newly created Digital Initiatives Librarian position within a newly created Digital Scholarship Unit. When job hunting, I find it's really important to distinguish between new positions and existing positions that have been vacated.","rowNumber":73},{"timestamp":"3/12/2013 6:02:41","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"* How would you describe yourself in three words?\n* How have you assisted nontraditional students?\n* Could you describe a project that you oversaw, and how you managed it?\n* If a coworker were telling a patron incorrect or incomplete information, what would you do?\n* Could you describe any supervisory or training experience?\n* Would you be willing to give class presentations for students, such as for information literacy?","whatquestionsdidyouasktheinterviewers":"* What ILS do you use?\n* What classification scheme do you use?\n* Do you think that being a small academic institution allows you to build stronger one-on-one relationships with students?\n* Have you considered using a content management system such as Drupal for your website?","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Reference","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":74},{"timestamp":"10/30/2013 11:14:18","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1.\tPlease give us a summary of your work history.  \n\n2.\tWhat is your experience working in a very busy and high stress front desk Library/Circulation job?\n\n3.\tThis job requires some knowledge of international affairs; what information resources both traditional and in digital format are you using to keep up-to-date?\n\n4.\tWhat is your experience working in multicultural settings? \n \n5.\tLibrarianship has changed significantly over the past 5-10 years. How have you adapted to these changes?  Internet, search engines, databases on web vs. proprietary software, electronic resources vs. print?\n\n6.\tWhat is your approach in performing collection maintenance duties? Please be specific.\n\n7.\tHow do you deal with conflicting priorities? \n \n8.\tHow well do you multi-task in a Library environment?  Please provide an example. \n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Government Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Reference","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":75},{"timestamp":"3/25/2013 3:00:56","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"How will you cope with a busy school environment (eg - lunchtime) and how will you feel if asked to change chore/job in a short space of time? \n\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"Cataloging/Technical Services, Teen Services","whereareyou":"Australia/New Zealand","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":76},{"timestamp":"3/11/2013 19:39:19","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1) What qualities does a leader have? Do you posses these qualities? \n\n2) Can you give an example of a creative project you've completed? \n\n3) Specific, customer service related scenarios relevant to the department's mission. ","whatquestionsdidyouasktheinterviewers":"1) What differentiates a good head of _________ from a great head of __________?\n\n2) How critical is the __________ department to the library's mission? \n\n3) What is your timeline for making a decision? ","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":77},{"timestamp":"3/11/2013 20:01:30","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1) \"Is our water not good enough for you?\"\n\nIn response to me bringing a bottle of water in case none was provided.\n\n2) \"Are you going to be able to get to work, you don't live in this city?\"\n\nBut they knew I currently worked at a job that involved driving twice as far one way.\n\n3) \"Are you a rule-follower, or a rule-breaker? And you can't waffle, you have to pick one or the other.\"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Canada","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"I propose two categories, questions that make sense and stupid ones. I can't believe some of the questions I have been asked by professional librarians. I seem to only be able to remember the stupid ones.","rowNumber":78},{"timestamp":"3/12/2013 15:59:14","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Describe your method of making a decision.\n\nWhat are the three most important things you look for in a school? (I was interviewing for a school Librarian position).\n\nWhat would you do for a child who is new to the school and speaks no English?\n\nWhat are some technology tools you would introduce to the students?\n\nWhat is your approach to collaborating with teachers?\n\nWhat experience do you have with iPads?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Interim School Librarian","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Southern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":79},{"timestamp":"3/13/2013 8:13:59","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Building a list/Initial screen","whatquestionsdidtheyaskyou":"Scenarios--for ex., \"What would you do if you were helping someone in-person at the desk, and the Friends of the Library president walked up with a potential donor, just as the phone started to ring?\"\n\n\"What parts of your library work do you enjoy the most/least?\"","whatquestionsdidyouasktheinterviewers":"\"What's special about your library?\"  \"What is your service philosophy?\"  \"Would I be helping with programming?\"","whatpositionlevelwasitfor":"temporary ","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":80},{"timestamp":"3/13/2013 20:54:40","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1)  Describe your experience in developing programs for youth\n\n2)  How do you build relationships with school and local community service organizations?\n\n3)  Name a Newbery, Caldecott, or Printz award winner you’d recommend and explain why.\n\n4)  What professional development activities are you currently involved with? \n\n5)  Describe your experience in website development.\n\n6)  Describe your experience in providing readers' advisory to youth\n\n7)  A parent doesn’t approve of a particular book you have in the library.  How handle this?\n\n8)  How do you deal with noisy kids and parents at storytime?\n\n9)  Describe your experience in developing a reading program for youth\n\nIn addition, I was asked to develop a sample storytime plan, including a list of books to read and early literacy activities to accomodate the books (e.g. songs, crafts, etc.).  I also had to select a book to read to the hiring committee, simulating what I would do if presenting a storytime","whatquestionsdidyouasktheinterviewers":"When will the hiring decision be made?  \n\nBesides that, I don't remember. ","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":81},{"timestamp":"3/16/2013 10:32:11","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"A mother comes in, leaves her 3-year-old daughter in the children's room, then goes to the beer store. What do you do?\n\nTell us about our library's service area and community.\n\nWhat would you recommend to a 12 year old, male, reluctant reader?\n\nHow do you view the importance of outreach?\n\nWhat are you reading and who would you recommend it to?","whatquestionsdidyouasktheinterviewers":"It was a large library system, so I asked how they did things on a branch level but still made it feel as though it was a cohesive system of libraries.\n\nWhat kind of opportunities do you offer for staff training and professional development? ","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":82},{"timestamp":"3/28/2013 18:01:10","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1. Name 3 facts about early literacy that have application in the library\n2. What would you do for a Chinese New Year's display?\n3. Describe a children's book you've read recently, and who the audience is.\n4. Do a fingerplay for a toddler story time.\n5. What makes baby story time different from preschool story time?\n6. How would you plan a program with community partners, like a museum?\n7. How would you plan a program for school-age children? (goals, target age, etc.)\n8. How would you get Spanish speakers to attend a dia de los muertos program?\n9. How would you advise your branch manager on how to cater to disabled children?\n10. A patron objects to the presence of comics and graphic novels in the children's section. How would you respond?\n11. Tweens are often sitting around waiting for the computers. What program would you plan to occupy them?","whatquestionsdidyouasktheinterviewers":"-What ages would I be serving?\n-I asked about the library system and organization, where collection development happens, etc.\n-What is life like in a branch?\n-Is there a possibility for this position to be permanent?\n-What kinds of opportunities are there for advancement and professional development?\n-When will I be notified?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":83},{"timestamp":"4/16/2013 9:37:38","whatkindofinterviewwasit":"","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"How do you handle a stressful situation at the library","whatquestionsdidyouasktheinterviewers":"What my first priority be when signing on in the position","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Midwestern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":84},{"timestamp":"5/9/2013 9:01:04","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"How would you attract kids to the library?\nWhat do you think of Accelerated Reader? \nWhat do you do with a parent who wants a book removed?\nWhat if the administration asks you to remove a book?\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Senior Librarian","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":85},{"timestamp":"5/16/2013 7:31:13","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Only one round","whatquestionsdidtheyaskyou":"What are some up and coming trends that excite you in the children's library world?\n\nWhy are you interested in working in public libraries instead of academic or school libraries?\n\nHow do you plan a storytime? How do you evaluate your success or failure after a storytime?\n\nTell us more about your experience at [recent/related] job.\n\nAs a children's librarian, you will also be working with adults and teens. What experience do you have with those groups?\n\nDescribe your ideal coworkers. Describe your ideal work environment.","whatquestionsdidyouasktheinterviewers":"How does this branch fit in to the community? What do you see as the areas of growth within the community for this branch?\n\nThinking back to people who have had this position before, what differentiated the truly outstanding from the merely good?\n","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Texas!","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":86},{"timestamp":"3/12/2013 6:47:03","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What is your Philosophy of Education and how does that relate to the Library?\nHow does the Library and Library instruction relate to the Common Core Standards?\nWhat is your top three selection of books for elementary, intermediate and middle school students?\nHow would you interact with and ensure the Library aides are doing their jobs throughout the day when the Librarian is gone?\n\n\n","whatquestionsdidyouasktheinterviewers":"What does the typical day of a Library Media Specialist look like?\nWhat is the school's plan for the upcoming year to ensure accreditation?\n","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"Children’s Services, Instruction","whereareyou":"Midwestern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":87},{"timestamp":"6/10/2013 20:39:22","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Building Interview","whatquestionsdidtheyaskyou":"Describe your experience with technology.\nHow would you approach collaborating with teachers?\nWould you be willing to read to upper-elementary classes?\nHow would you work with an aide?\nHow would you handle the following situation? Suppose you are teaching a class in the lab, a teacher who is in the middle of a lesson needs your help, and a student wants you to help him find a specific book all at the same moment.\nI was given a task: write a letter that you might send out to the school community as the new LRC director.\nIf I walked into the LRC on any given day, what could I expect to see?\nWhat grant-writing experience do you have?\n\n","whatquestionsdidyouasktheinterviewers":"What do you especially like about the LRC now, and what would you like to change?\nWhat are the strengths and weaknesses of this school?\nIn what ways can I best support the teachers and classroom instruction?\nWhat is the budget for the LRC?","whatpositionlevelwasitfor":"LRC director","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"Children’s Services, Instruction, technology instruction, instructional support","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"I attended a career transitions group in my area. The group met once a week for 10 weeks and was led by two HR people and two head-hunters. Though some information did not relate to finding a job in schools, I found other information and advice very helpful.","rowNumber":88},{"timestamp":"6/10/2013 5:57:37","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First, then second round","whatquestionsdidtheyaskyou":"-Tell me about yourself.\n-Why are you interested in working here?\n-What motivates you?\n-What would you do if a parent complained about a book or video in the library?\n-What book(s) are you reading right now?\n-What's your favorite book?  Favorite children's book/author?\n-Tell me about a time you had problems with a coworker and how you resolved it.\n-What would you include in a storytime?\n-Are you flexible?  Is your schedule flexible?\n-Give me an example of a time you were reliable.\n-What are your strengths and weaknesses?\n-What are your three biggest accomplishments?\n-How comfortable are you with technology?\n-Where do you see yourself in 5 years?\n-Which age group would you prefer to work with?","whatquestionsdidyouasktheinterviewers":"-On average, how many children attend programs and storytimes?\n-What goals do you have for the person in this position to accomplish over the next year or so?\n-Are the different departments in this library cooperative / does everyone get along well and help each other out?\n-How many librarians and other staff work in this department?\n-What do you like most about working here?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services, Outreach, Programming, Reference","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":89},{"timestamp":"3/19/2013 13:12:47","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Our summer reading theme is \"_____\" give us an example of two YA books you would pick that fit this theme, and then give a book talk for one of them as if you were giving it to a group of teens. \n\nA patron comes to you for information about homelessness. What would your subsequent action/questions be? After I answered they asked this patron now explains that he/she is homeless, would your answer to the first question be different. ","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Children's Librarian","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services, Programming, Reference, Teen Services","whereareyou":"Midwestern US","whereareyou_2":"","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":90},{"timestamp":"3/12/2013 18:13:07","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What was your most recent job/volunteer experience & when.\nWhy did you leave?\nAre you available fo the hours needed?\nAre you willing & able to perform all duties described?\nWould your schedule be likely to change over the next year?\nWhy did you decide to apply for this position?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Page","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services, Teen Services","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":91},{"timestamp":"3/12/2013 18:30:16","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"What duties did you like most & least at your last job, & why?  Tell us about a time you made a mistake in your job and how you handled it.  Tell us about a time you went above & beyond in customer service.  Describe a time you had a communication problem with someone and how you overcame it.  Do you prefer to work alone, or as part of a team?  How would you handle a difficult situation iwth a co-worker, such as not pulling their weight?  How can an employee show initiative?","whatquestionsdidyouasktheinterviewers":"How the programming changes from what is currently shown on their calendar on the website in the summer.  Do they have many issues with parent trying to dump kids & use the library for free day care?  How stable is the position (likely to be cut due to funding)?  What would a typical day be like?  How much turnover for this position and in general?  Is certification desired (state requires for librarians, but optional for para-pro)?  What is the hiring time frame?","whatpositionlevelwasitfor":"Page","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services, Teen Services","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"I was suprised I did not get any specific questions about my background, why I did not want to return to my previous career (after being a SAHM), or any specific llibrary or children-related questions.  I know these \"behavioral\" interviews are the rage now, but I do not see how they can get enough info to pick the best candidate only using those generic, canned, HR-directed questions.  I really expected more straight-forward, practical questions for this type of job.  Oh, there was also a shelving test, one set of cards with call numbers & one set with authors' names to be put in order. ","rowNumber":92},{"timestamp":"3/21/2013 10:12:40","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What are you most proud of at your current position?\nHow will you help your supervisor transition when you come work for us?\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Library Clerk","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Circulation","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"The position I applied for was in the same library which is why some of the questions may seem odd.","rowNumber":93},{"timestamp":"5/21/2013 14:21:15","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What do you know about this institution?\nTell me about your prior library experience?\nWhat classification systems did they use?\nDo you have an e-reader?\nHow much responsibility did you have while your library director was out of the country?\nWhat OPACs have you used?\nIf you were the only person on the desk and had several people in line, a printer jam, and a ringing phone, how would you prioritize?\nWhat areas would you like to learn more about?\nHow have you dealt with problem patrons or coworkers?\nWhat website were you responsible for updating?\nWhat can you tell me about Drupal and Joomla?","whatquestionsdidyouasktheinterviewers":"How did this position become available?\nWhat is your management style / institution culture?\nIs there anything about me that concerns you or I need to clarify?\n","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Circulation","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":94},{"timestamp":"6/10/2013 19:00:43","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Digital libraries","whereareyou":"Midwestern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"I'd like to see a column on things INTERVIEWERS shouldn't do. From my most recent interview experience, please don't:\n\n1. Wear flip flops or cutoff shorts if you're one of the people meeting/interviewing the candidate.\n2. Spend the entire candidate dinner gossiping about your coworkers without asking the candidate any questions. \n3. Choose your most socially awkward member of the search committee to drive your candidate around town and show her the sights. ","rowNumber":95},{"timestamp":"3/11/2013 13:06:11","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"Building a list/Initial screen","whatquestionsdidtheyaskyou":"Examples of being able to adapt and pick up new skills quickly.\nExperience with barcoding.\nExperience in a library setting.\nExperience with engineering and geology. \n","whatquestionsdidyouasktheinterviewers":"How large was the collection they were adding to the electronic catalog?\nHow many people were working in the library?\nHow long did they expect the project to take?\n","whatpositionlevelwasitfor":"Library Clerk","whattypeoforganization":"Special Library","jobfocuswascheckallthatapply":"Engineering","whereareyou":"Canada","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"The interview went well, and I sent them a thank you email afterwards thanking them for their time. They responded to the email, but then never contacted me again about the position. I thought this was very unprofessional, especially after a half hour interview. ","rowNumber":96},{"timestamp":"3/18/2013 11:11:01","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Only round","whatquestionsdidtheyaskyou":"They did not probe as deeply as I expected, as it was a new library and the Board of non-elected community members had little knowledge of libraries, but I was asked one insightful question, which every librarian should think about:\n\nThey wanted to know what I would prioritize in spending very limited collection development dollars.  Would I spend money to build a core collection of classics, even if they were never used, or would I focus solely or largely on buying popular items.\n\nThis gets to the issue of a librarian's general philosophy of the role of libraries (as an educational institution for the masses?), awareness of user patterns (popularity is often very fleeting... patrons might all be clamoring for a certain book and then a year later never check it out), and how, quite specifically, a candidate would actually spend the library's money.","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Director/Dean","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Everything (small library)","whereareyou":"Northeastern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":97},{"timestamp":"3/13/2013 21:05:03","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Why does this position appeal to you?\nDescribe outstanding customer service.\nRate your communication skills on a scale of 1-10.\nWhat methods do you use to communicate?\nHow do you prioritize your workload and how do you communicate that to others?\nWhat is your opinion of using technology to improve services?\nDo you prefer team or individual work?\nDescribe your computer, software, and data entry skills.\nA question about working in a diverse environment (can't remember how it was posed)\nWhat do you avoid at work?\nHow do you resolve conflict?\nTell us about your experience with OCLC, ILS, ILLiad, and research.\nHow do you master a new task?","whatquestionsdidyouasktheinterviewers":"How big is the Document Delivery Services department?\nCould you please tell me more about one of the listed job duties: \"Works at service desk\"?\nWhat is the best part about working at your library?\nWhat is the library like between semesters?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"ILL, document delivery","whereareyou":"SW US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":98},{"timestamp":"3/11/2013 16:40:47","whatkindofinterviewwasit":"Phone & in-person for same job","whatlevelinterviewwasit":"First round (phone) & final round (in-person)","whatquestionsdidtheyaskyou":"Tell me about a time you made a mistake and how you fixed it.\nWhat accomplishment are you most proud of at your previous position?\nIn your opinion, what is the best \"Star Wars\" movie? [I had described librarians as 'information Jedis' in my presentation.]\nWhat experience do you have with instruction?\nDo you prefer working alone or in a group?\n","whatquestionsdidyouasktheinterviewers":"What opportunities are provided for professional development?\nDuring one part of a day long interview, I met with the entire ~15 person department. They briefly introduced themselves and talked about their different projects. I took notes on a small notepad, so when it was my turn I could ask people about specific projects.\nWhat is the work environment like with regards to dress?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction","whereareyou":"Midwestern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"If the position announcement is thorough, go through each bullet point and list all your qualifications - more than you could fit into a cover letter. Have this with you so you can refer to it during a phone interview. For my phone interview for this particular position, EVERY question they asked during the 20 minute interview came directly from the position announcement.\nRead the organization's mission statement (and the mission statement of the parent org, if different). Jot down phrases that you find relevant to the position to weave into your answers (if appropriate).\nAlso, keep current on news about general library stuff and your area of interest (I do it by reading blogs). During the phone interview I mentioned how SUNY-Potsdam had just dropped their ACS subscription - I firmly believe that helped me move on to the in-person interview.","rowNumber":99},{"timestamp":"3/13/2013 7:02:18","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"Describe a time you worked with a problem patron and how you handled the situation.\nHow do you plan for a one shot session?\nHow would you describe your teaching style?\nTell us one positive thing and one negative thing about yourself.\nWhy are you looking to leave your current position?\nWhat appealed to you about this position?\nWhat was one thing that surprised you while you were researching our institution?\nHow do you work with reluctant or resistant faculty members?\nHow do you sustain your passion for teaching?\nDescribe a project you completed, which you took the initiative to begin.\nAre you a cat person or dog person?\n","whatquestionsdidyouasktheinterviewers":"Is Information Literacy included in the Core Curriculum?\nDescribe 3 collaborative efforts you have undertaken.\nWhat is your management style?\nDescribe you student population.\nWhat are your expectations from this position and/or what are specific projects you would like to see them complete?\nPlease talk about the library's relationship with university administration.\nCan you tell me about the travel and technology budgets for the library?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction","whereareyou":"","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":100},{"timestamp":"3/13/2013 9:56:31","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What kind of skills do you feel an Academic Librarian should possess?\n\nIf we were to speak with you supervisor and co-workers, what would they say your strengths and weaknesses are?\n\nThere is some conflict with one or your co-workers. What would you do or how would you handle this situation?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Faculty Librarian","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":101},{"timestamp":"3/14/2013 6:36:27","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"What do you want to move to Cairo, Egypt?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction","whereareyou":"Midwestern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":102},{"timestamp":"3/11/2013 13:00:28","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"Please describe a time you had to deal with a difficult patron and how you handled that situation.\n\nWhat accomplishment at your current job are you most proud of?\n\nHow do you feel about discovery services like Summon?\n\nIf you could have any superpower, what would it be and why?","whatquestionsdidyouasktheinterviewers":"I studied the latest annual report of the library and asked questions stemming from that. This let me show that I did my homework and could ask questions about current and future projects - and perhaps interject how I could be involved in those projects.\n","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Liaison, Outreach, Reference","whereareyou":"Midwestern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"Please link this eventual spreadsheet to http://opencoverletters.com/\nThat site helped me fine-tune my cover letter - and I got the job.\n\n","rowNumber":103},{"timestamp":"3/11/2013 14:55:57","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"The in person interview comes after phone interview","whatquestionsdidtheyaskyou":"What are your thoughts on peer-to-peer? What are your career aspirations? What was your favorite class while getting your MLIS? What do you think of the role of instruction in public services? Do you think individual instruction is useful? What do you think the library's next step in social media should be? What do you think is the next new thing in social media?","whatquestionsdidyouasktheinterviewers":"(I'm already employed by the library, so I didn't have many questions.) How does the library handle travel reimbursement for faculty? ","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Liaison, Outreach, Reference","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"Be yourself! In my experience the employees already know me, so my job was to make them see I'm faculty material. Even if they don't know you, it never pays to pretend: you want them to hire YOU, not some make believe person. ","rowNumber":104},{"timestamp":"5/11/2013 21:23:49","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1. What skills do you possess that relate to the job at hand?\n2. Tell us about a challenging reference question and how you handled it.\n3. What are two adjectives that describe you: How have they been an asset. How have they been a detriment.\n4. Tell us about a recent instruction session that stood out. Why did it stand out?\n5. What else would you like us to know about you.","whatquestionsdidyouasktheinterviewers":"None! They didn't give me an opportunity. After their last question they swooshed me out (nicely). That was that.","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Liaison, Outreach, Reference","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":105},{"timestamp":"10/1/2013 12:57:37","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"If your co-workers were to describe your work in as few words as possible, what would they say?\nWhat role does technology have in reference work?\nIf you firmly believe your supervisor is wrong how would you go about addressing the situation?\nDescribe a project where you took initiative and the results weren't what you expected? In retrospect, what would you have done differently?\nWhat might your strategy be to develop an effective liaison program program?","whatquestionsdidyouasktheinterviewers":"I see this is a new position. Can you tell me a little about the reason why this position was created?\nHow is one evaluated on the job? or How does the promotion process work? This position is for a library faculty member and carries requirements for promotion.\n","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Liaison, Outreach, Reference","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"Before we started, I made a general statement of how I was going to proceed. I told them I would write down the question, restate it to make sure I understood it correctly, gather my thoughts, and proceed with my answer. I wanted to make them aware of my process to attenuate any awkward slience and to demonstrate how I might manage a reference question. I made sure to write down their names and to thank them for their question by name (eg. Thanks Mary, that's a great question). The interview was scheduled for a half-hour, so I had to be really precise in my answers. Also, it took place on a Friday, so I waited until Monday to send thank-you emails to every person on the committee. In my thank-you message, I referenced their specific question (eg. I appreciate you question about outreach services) and briefly mentioned anything I wanted to add with the caveat that I didn't expect my additional response to be taken in consideration. I wanted them to know that I gave their question thorough consideration, with the secondary aim of setting forth my ability and willingness to follow up on a reference question I might get. Timeline of the whole process: applied in early March; contacted for phone interview in July; contacted for campus interview late August; full academic interview took place mid September; now, I just wait.","rowNumber":106},{"timestamp":"3/11/2013 15:50:23","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What science blogs have you read recently?\nWhat are key attributes that you feel a teacher should have?\nWhat are your research interests?\nWhat is your communication style?\nDescribe an ideal challenge you have had with a colleague?\nWhat software are you proficient using?\n","whatquestionsdidyouasktheinterviewers":"What are some first tasks you would like the person who fills this position to work on?\nWhat type of committee work with the person in this position work on?\nWhat's the next step in this process?\nCould you describe a typical day for the person in this position?\nHow is the library viewed among students? faculty? the university?\n","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Liaison, Reference, Web Services","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":107},{"timestamp":"3/11/2013 14:59:12","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Application","whatquestionsdidtheyaskyou":"How do you approach collection development?\nHow do you implement technology in the library?\nHow would I make students feel welcome in the library?","whatquestionsdidyouasktheinterviewers":"What opportunities would there be for me to collaborate with teachers?\nWhat were the administration's priorities for the library program?","whatpositionlevelwasitfor":"head campus librarian (HS)","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"Instruction, Outreach, Teen Services","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"An applicant MUST understand what the administration has in mind for the position: some administrators know nothing and have a closed, boxed-in expectation. And life is too short to work for them!","rowNumber":108},{"timestamp":"3/22/2013 19:24:42","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Describe yourself.\nClassroom Management\nWhat can I add to the library?\nTechnology experience \nEnd of the year shut down- can I complete inventory?\nWhat do I envision as a typical library day?\n","whatquestionsdidyouasktheinterviewers":"Scheduling\nWhether or not there were planned collaborations for the time I would be there\nWhat circulation system the library used","whatpositionlevelwasitfor":"Long term substitute school librarian","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"Instruction, Programming, Teen Services","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":109},{"timestamp":"3/11/2013 9:55:36","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"*What is your experience with automated systems and with computers in general? \n*What two or three professional/personal accomplishments have given you the most satisfaction? \n*Please describe your teaching philosophy and provide examples: \n*Can you recall your most disappointing work or teaching experience and what did you do to correct the situation? \n*Please describe your experience and proficiency using reference resources and databases. Provide examples and name of databases in your experience.\n*What would you do if you were at the reference desk and both the phones were ringing and there were three or four patrons already waiting and a demanding professor interrupted? \n*Where do you expect to be professionally in five years? ","whatquestionsdidyouasktheinterviewers":"*What are some of the requirements for fixed-term faculty members for promotion and contract continuation?\n*What types of courses will I teach? One shots, semester long information literacy?\n","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Southern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"Many of the questions I was asked are pretty standard interview questions. These are a few that stuck out for me. \n\nI was offered this position two days after my interview. Since starting the job late last year, I have been on hiring committees for other open positions in the library. It has been quite interesting sitting on the other side of the table. \n\nGood luck in your job hunt!","rowNumber":110},{"timestamp":"3/11/2013 10:32:44","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Building a list/Initial screen","whatquestionsdidtheyaskyou":"Tell us about yourself\nHow do you keep current?\nHow have you handled a difficult person?\nWhat is something you did at your past/current job that no one thought of before and made a difference?\nWhat do you look for in a job?\nWhat tasks do you really dislike?\nHow would you expect a library commons work environment to operate? \nWhat is your experience with library skills/bibliographic training?\nWhat is your experience with social media?\n","whatquestionsdidyouasktheinterviewers":"Where does the need for this position come from?\nDescribe a typical day for this position\nWhat is the communication style like for this team? \nWhat is the communication style like for the supervisor of this position?\nWhy do you enjoy working here/what keeps you here?\nWhere are you in the process of filling this position?\nWhere do you think I fit with your goals for this position? (asked at the end)","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"I often have no trouble finding lists of questions but I often struggle to come up with adequate answers.  What are the correct answers to the above questions?  Would it be possible to add a field to the database/spreadsheet with some hints at possible correct answers?\n","rowNumber":111},{"timestamp":"3/11/2013 13:00:09","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"I was given a list of 8 questions mostly related to library instruction and policies. For example: experience enforcing behavior policy, dealing with disruptive and cheating students, what my policy would be on accepting late assignments, what my experience with teaching web 2.0 tools and I also had to give a demonstration of how to use a database.","whatquestionsdidyouasktheinterviewers":"What the role of the position was in the greater scope of the library.","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"It was a part time position and they still weren't sure exactly what the position was that they were hiring for and gave no indication of the type of hours it would be. It was listed as a \"pool\" position so I am not sure if they are just generating a list through this recruitment.","rowNumber":112},{"timestamp":"3/11/2013 15:36:48","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Application","whatquestionsdidtheyaskyou":"What do you like about reference work?\nWhat kind of library chat service does your current employer use? What experience do you have with virtual reference?\nWhat is an example of an interesting/memorable reference question you've been asked?\n","whatquestionsdidyouasktheinterviewers":"Where are the rest of your instruction video tutorials on your website?\nWhat are the normal hours for this position?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Northeastern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":113},{"timestamp":"3/11/2013 16:24:27","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What are your thoughts on librarian-faculty collaboration?\nWhat most appeals to you about the position?\nWhat is least appealing to you about the position?\nWhat is your background with archives?\nHow would you help a student - who has never used an electronic database before - look up sources for a research paper?\n","whatquestionsdidyouasktheinterviewers":"When giving information literacy instruction, are the librarians required to follow a prepared outline?\nHow is information literacy instruction integrated into online courses? ","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Southern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"It seems like a no-brainer, but know your resume/CV forwards, backwards, and inside out. If they ask you about something you put down there, you want to be able to give an intelligent response, especially if they have a different idea of what some terms mean (like emerging technology).","rowNumber":114},{"timestamp":"3/12/2013 6:31:17","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"Building a list/Initial screen","whatquestionsdidtheyaskyou":"How many classes per semester do you teach? What techniques do you use to make the subject matter interesting for students?  What new technology do you use?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":115},{"timestamp":"3/12/2013 7:51:39","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What do you like most and least about teaching?\nTell us about your experience in working at a reference desk.\nDescribe a time when you had to collaborate with someone on an instruction module or session.\nWhere do you see yourself in 5 years?","whatquestionsdidyouasktheinterviewers":"What is the current relationship between the library and other academic departments, especially in terms of instruction?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Midwestern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":116},{"timestamp":"3/13/2013 17:04:18","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"not sure","whatquestionsdidtheyaskyou":"1.      Please describe how your professional background has prepared you for this position.\n\n2.      Please tell us about your experience in providing reference and instruction.\n\n3.      Describe the most significant or creative idea or presentation that you\nhave developed and/or implemented as part of your work in library instruction.\n\n4.      Please tell us about your experience with cataloging or the organization of library materials.\n\n5.      What are some of the recent trends you are seeing in reference or library instruction?\n\n6.      What do you know about our library?  Our university?  Our community?\n\n7.      What questions do you have for us? ","whatquestionsdidyouasktheinterviewers":"1. Can you tell me more about the information literacy degree requirement? There’s just a tutorial to complete? How has it affected the librarians’ work? \n2. Does this position involve supervising librarians or staff, or just working as a team with them? \n3. What is the timeframe of your search? Next steps? Possible start date?","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Midwestern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"I am in the suburban South, but the job is in the rural Midwest. Not sure which information you really were asking for in those last two questions.","rowNumber":117},{"timestamp":"3/21/2013 8:35:06","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What do you know about _[our institution]_?\nIf you could choose your area for collection development, what would it be?\nTell us of a time where you had a disagreement with a coworker. What did you do to resolve it?\nWhat are your three favorite reference resources?\nHow would you convince faculty of the necessity of library instruction?\nWhy should we hire you?\nWhat are three accomplishments that you are most proud of to date?\nIf we were to call your supervisor right now and asked about you, what would be one thing that he/she would say that you needed to work on?\nHow do stay up to date on library trends?\nWhat is your experience with using active learning in instruction?","whatquestionsdidyouasktheinterviewers":"What do you enjoy about working at _[location]_?\nDo you have any specific projects in mind that you would like to see the person in this position work on?\nWhat qualities are you looking for in a successful candidate for this position?\nWhat active learning techniques are currently beings used by the instruction librarians here?\n","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"As a candidate for an Instruction position, I was also expected to prepare a 15-20 minute instructional demonstration for a college freshman level English class.","rowNumber":118},{"timestamp":"4/14/2013 7:40:40","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What do you know about our institution?\nIf you could meet anyone, from the past or present, who would it be and why?\nWhat are your long term goals?\nWhy are you leaving your current position?\nWhat are your salary expectations?","whatquestionsdidyouasktheinterviewers":"What is a typical day like in this position?\nWhen will I hear from you next?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":119},{"timestamp":"4/26/2013 10:40:48","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"How are you with managing people, have you dealt with collection development, handling budget, scheduling of employees, what type of management style I prefer, or am I, what would I like to leave my legacy, what book am I reading now, if I have a patron at the desk and one on the phone, how would I handle the situation. How would I handle two employees that can't work together, do I like working as a team or by myself, they wanted me to tell them about myself, ask me what my strength and weakness are","whatquestionsdidyouasktheinterviewers":"What are the hours of  the position, was there any weekend involvement, how are they collaborating with faculty, how soon are they looking to fill the position. What type of person are they looking for, for the position","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"I have had several interviews ","rowNumber":120},{"timestamp":"5/27/2013 13:01:36","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What interested you in this position?\nDescribe your experience with reference as well as your reference philosophy.\nDescribe your library teaching experience as well as your teaching philosophy.\nWhat do you see as the greatest challenges for academic libraries today?\nWhat do you see as the most exciting online tools for library teaching?\nDescribe a time where you have been innovative in your job.\nWhat traits do you value in your coworkers?\nWhat are your research interests?\nDescribe a difficult situation you've experienced at work and how you resolved it.","whatquestionsdidyouasktheinterviewers":"What type of instruction sessions is this position primarily responsible for?\nCan you tell me about the promotion and tenure process?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":121},{"timestamp":"9/18/2013 5:59:40","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"What is an example of a reference question you have assisted on?\nWhat is your dream job?  \nIf your student is irritable when at the reference desk, how would you handle this situation?  \nWhat is your favorite databases?","whatquestionsdidyouasktheinterviewers":"What is it like to work in your library?  \nWhat are common reference questions asked? \n","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference","whereareyou":"Midwestern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":122},{"timestamp":"3/11/2013 13:07:06","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"The most notable was:\n\"What have you done to prepare your current job for your replacement?\"","whatquestionsdidyouasktheinterviewers":"\"What would success in 12 months look like (for this position)?\"\n\"What are the major challenges and opportunities for the library?\"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference, Emerging Technologies","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"Despite all odds, work to stay positive.","rowNumber":123},{"timestamp":"3/13/2013 17:16:10","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"final round","whatquestionsdidtheyaskyou":"[among others]\n1. Describe your experience working with a diverse student body, including students of color, LGBTQ, etc.\n2. Give an example of how you work independently?\n3. Give an example of working in a team?\n4. Describe how you would prepare for an instruction session.\n5. How would you asses your skills in the areas of listening, written communication, public speaking, and working in a group? What feedback have you received from others about your skills? In which of these areas are you the strongest?\n6. How would you reach out to faculty to improve the instruction program?\n7. What kind of people/personality traits do you have difficulty working with, and what do you do about it?\n8. What do you do to engage students and keep their attention in your classes?\n9. Why are you interested in working at this university?","whatquestionsdidyouasktheinterviewers":"to various people throughout the day:\n•\tHow would your students describe the library?\n•\tHow would you describe the students?\n•\tHow do the faculty view the library, considering you (the librarians) do not have faculty status?\n•\tHow does the library fit into the campus culture? \n•\tWhat do you like about working here?\n•\tHow much instruction do you do each semester? \n•\tWhat aspects of the library do you want to strengthen?\n\nto the provost:\n•\tHow well does the library interact with other units of the university?\n•\tWhat is something happening with the university that you’re excited about? \n\nto the search committee:\n•\tAny idea yet which liaison areas this position would be responsible for? Or does it depend on who you hire?\n•\tBalance between reference/instruction and cataloging?\n•\tHow do you manage the workflow of the text and IM reference?\n•\tTypical workday schedule (hours), reference schedule (including nights and weekends?)\n•\tDo you have workshops/meetings with other librarians in the area? From the state system? What other professional development opportunities are available?\n\nto the library director:\n•\tSalary? \n•\tOrganizational structure of the library?\n•\tFunding available for conferences? Other professional development opportunities?\n•\tWhat aspects of the library do you want to strengthen?\n•\tHow does promotion work?","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Reference, mostly reference and instruction, plus about 20% cataloging","whereareyou":"Midwestern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"This was a day-long campus visit that involved separate meetings with the search committee, provost, and library director, among other activities. Hiring library is rural Midwest; I am in the suburban South.","rowNumber":124},{"timestamp":"3/15/2013 6:29:50","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"We noticed that you have your MLS. I didn't realizine you had an MLS. Why are you applying for THIS job?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Interlibrary Loan Specialist","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Interlibrary loan lending","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"It is really hard to find a job. Age discrimination is real. ","rowNumber":125},{"timestamp":"3/13/2013 15:29:44","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Why do you want this position\nWhat challenges have you faced and how did you resolve them-give specific examples!\nDo you work well independently\nHave you ever supervised others","whatquestionsdidyouasktheinterviewers":"Is this a new positistion or a replacement\nWhat department is this position part of\nIs there much travel involved","whatpositionlevelwasitfor":"Senior Librarian","whattypeoforganization":"Special Library","jobfocuswascheckallthatapply":"Law","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"Practice your answers. I spent seveal days writing possible questions and answering them out loud over and over. I felt very confident once I was there for the interview because I spent so much time preparing. I also would say give yourself lots of time to get there, so you are not stressing about being late. Better to be very early and have time to relax before your meeting. Also be prepared to be there any amount of time. I was not sure what to expect and spent three hours meeting with several different people.","rowNumber":126},{"timestamp":"4/25/2013 16:24:33","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"What question were you expecting me to ask that I have not?\nWhat question are you hoping that I don't aks?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Liaison","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":127},{"timestamp":"6/11/2013 9:16:08","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What made you apply to this job; Can you describe your current position; What are your strengths","whatquestionsdidyouasktheinterviewers":"I asked a specific question about a program that the library ran, and if the position I applied for would participate in that program.","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Liaison","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":128},{"timestamp":"3/21/2013 10:36:16","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Describe a project you undertook that included planning and organizational steps.\n\nDescribe a successful and unsuccessful reference interview you have given.\n\nWhat is the librarian's role in bibliographic instruction?\n\nHow should a librarian engage the students in bibliographic research?\n\nWhat is your approach to serving as a liaison?\n\nHow would you develop a collection plan that meets the needs of the faculty, graduate students, and undergraduate students?","whatquestionsdidyouasktheinterviewers":"What is the nature of the vacancy?\n\nHow soon would I be expected to be up to full speed?\n\nWhat kind of instructional sessions are offered?\n\nI noticed many departments did not have research guides on the website.  Would the new incumbent add these?\n\nWhat is the process and timeline for tenure review?\n\nWhat is the remaining schedule for this search?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Liaison, Reference","whereareyou":"Midwestern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":129},{"timestamp":"3/12/2013 12:11:45","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What is your management philosphy?  How experienced are you with copyright?  How do you stay current with library trends and technology?  What drew you to the position?  If we hired you, what do you want to focus on first after you complete initial training?","whatquestionsdidyouasktheinterviewers":"What opportunities are available for professional development?  Are there any big projects that need to be addressed by this position very quickly after hire?  It came up in the interview that in the next year construction for a learning commons would be started, so I asked about their goals with the project and shared my own experience with having a learning commons built at my previous library.","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Liaison, Reference, Access Services","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"My first interview for a librarian position was three months ago and I was very nervous, so I wish I could remember more questions for you.  Many questions were typical ones I expected after reading different interview tutorials.  The question about management philosophy was what threw me off the most.  I never thought about my management style in regards to a personal philosophy before so I had to think about it.  I was lucky enough to get the job though, so I hope others don't lose hope and keep on trying!  I graduated last December with my MLS and I think the fact that I applied to a university in a small town was a large factor in getting the job.  Not everyone is willing to work in a tiny town so I had less competition.","rowNumber":130},{"timestamp":"4/7/2013 7:10:58","whatkindofinterviewwasit":"Supplemental application questions","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Senior Librarian","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"library","whereareyou":"india chennai","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":131},{"timestamp":"5/25/2013 1:49:50","whatkindofinterviewwasit":"Supplemental application questions","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Senior Librarian","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"library","whereareyou":"india","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":132},{"timestamp":"4/4/2013 9:14:17","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Regular questions such as why are you interested, career survey but these are worth adding to the list:\n\nYou've been out of work for 5 months, what have you been doing in the meantime?\n\nHow is reporting to a Library Board different than reporting to a Library Director?","whatquestionsdidyouasktheinterviewers":"Among the candidates being considered, is there an internal candidate?\n\nCould the committee provide an overview of the Library Board committee structure?\n\nWould they outline their strategic planning process?\n\nWhat are the priorities for the Library Director for the next year?\n\n","whatpositionlevelwasitfor":"Director/Dean","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Library board and volunteer coordination","whereareyou":"Canada","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"Practise, practise, practise.","rowNumber":133},{"timestamp":"3/12/2013 17:17:16","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What is your experience with social networking?\nWhat types of things would you do to support online students?\nHow do you deal with stress?\nHow do you handle difficult colleagues? \nDescribe a situation when you had to deal with a difficult patron?\nWhat do you think are three essential qualities of a librarian?\nDo you have experience providing online chat reference services?\nDescribe a situation in which you had to work with a team.","whatquestionsdidyouasktheinterviewers":"What do you like about working at this institution?  \nWhat are your expectations for the person in this position?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Medical","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"Thanks for providing this resource!  After this interview, I spent many days coming up with better answers that I wish I would have given.  Having a bank of library-specific questions to help with preparation would have been a great help.","rowNumber":134},{"timestamp":"3/21/2013 9:14:48","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"\"Discuss a difficult situation you've faced in the past with a coworker and how you resolved it.\" *yawn*","whatquestionsdidyouasktheinterviewers":"Where do you stand on RDA?\nWhat portion of the acquisitions budget is locked in and what portion is discretionary?\nWhat degree of interaction do you have with faculty on acquisitions?","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Medical","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":135},{"timestamp":"3/14/2013 9:42:01","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"1. How would I use social media to help promote the library?\n2. If I was given money to build a teen collection, how would I go about accomplishing this goal?\n3. If I had a difficult time understanding a patron, how would I go about handling the situation?","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"No focus","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":136},{"timestamp":"3/15/2013 7:48:53","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"Why did you apply for this job? \nWhy should we hire you? \nWhat is (insert organization name) to you? \nWhat is your experience with content management systems? \nWhat is your experience with HTML? \nHow many hours per week did you work at X? \nHow do you prioritize a heavy workload? \nHave you ever experienced burnout and if so, how did you handle it?\nWhy are you looking for a new job? \nTalk about past research you've done. \nWhat kind of cataloging rules do you use at your current position? \nName a time you dealt with a difficult person and how you handled the situation. \nDo you think it's important to keep current with technology? \nWill you miss X aspect of your current position if you work here? \nWhat kind of bibliographic tagging tools have you used? \nHow would you go about trying to answer a reference inquiry that you had little knowledge about? \nWhat kind of tools do you use to educate yourself about a new topic? ","whatquestionsdidyouasktheinterviewers":"Are the duties of the position as advertised listed in order of overall importance? \nOn average, how many inquiries come to X in a given week?\nAre these inquiries written, verbal and electronic? \nI read from the website that X has many volunteers. Do they ever contribute to the projects of this department? \nSince X has international branches, is it an asset for employees to be bilingual or have knowledge of foreign languages?\nHow does someone not familiar with the collection locate material? \nMust all updates to the website first be OK'd by X? \nWhat is the work week? ","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Special Library","jobfocuswascheckallthatapply":"Non-profit member services","whereareyou":"Mideastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"I learned from this interview that I need to be prepared with MANY questions. I met with 3 separate teams for whom I was to ask questions, and by the third round I was completely out of questions and had to think on my feet, which I wasn't prepared for. ","rowNumber":137},{"timestamp":"3/13/2013 10:32:28","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What has been a professional challenge for you?\nDescribe a problem that you've solved.\nWhat would you hope to do in this position within your first 6 months?","whatquestionsdidyouasktheinterviewers":"What are your priorities for this position within 6 months?\nSince this is a new position, have these duties been done by someone else up to this point or not done at all?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Outreach","whereareyou":"Southern US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":138},{"timestamp":"3/11/2013 20:41:26","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"* Where did I see myself in five years (and 10 years)\n* What kind of collaborative work have I done\n* Did I know EAD\n* What was a typical day like for me\n* Please talk about my digitization projects\n* Asked about my processing experience","whatquestionsdidyouasktheinterviewers":"* how many employees I'd be supervising\n* how many researchers they have\n* Teaching opportunities","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Archives","jobfocuswascheckallthatapply":"Outreach, Political archives","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":139},{"timestamp":"3/20/2013 14:07:34","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"List 3 things you learned about __PL in preparing for this interview and why you thought they were interesting.\nWhy do you want to work for __PL?\nTell us about an idea for a teen programming event and how you would go about planning it. \nTell us about a time when you had to be flexible.\nDescribe the reference/readers advisory interview.\nTell us about your supervisory style. How do you like to be managed?\nA patron is yelling at the circulation desk, calling the staff person an idiot and making a scene. What do you do?\nWhere do you want to be in 5 years?\nAre you willing to take out the trash if needed?","whatquestionsdidyouasktheinterviewers":"How is __PL preparing for the future of public libraries?\n\n","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Outreach, Programming, Reference","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"This library provides the questions to candidates 20 minutes before the interview. ","rowNumber":140},{"timestamp":"6/25/2013 15:15:25","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Among ones having to do with the job description (paraphrased):\nAre you an innovator or a fine-tuner?\nDo you work better up front or in the back? (i.e. do better with reference or with processing)\nWhat were the outreach initiatives like at my current institution?\nWhat do I usually do at my current institution?\nIf multiple patrons at the end of the semester came to do research at the same time, and a faculty member needed materials for a class, how would I handle that situation?\nWhat would be my management style?","whatquestionsdidyouasktheinterviewers":"Among others (paraphrased):\nWhat would a typical day be like working in this position?\nWould I be performing secondary tasks concurrently with the primary ones (i.e. would I have projects while working at the reference desk)?\nWhat is the process for fulfilling duplication and loan requests? ","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Archives","jobfocuswascheckallthatapply":"Outreach, Reference, Administrative","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":141},{"timestamp":"3/13/2013 9:48:21","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"These are questions outside of the normal interview questions:\n\nHow how your life experiences prepared you for this experience?\nHow good are you at convincing people?\nHave you taught any graduate-level classes?\nAs you know, electronic subscriptions are rising. How would you pay for them? How would you raise money?\nIf you had a preference, what area of the sciences would you choose and why?","whatquestionsdidyouasktheinterviewers":"How do you support your librarians professionally?\nWhy is this position open? \nIs this a new position?\nHow do you like working here?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Outreach, Reference, Collection Development","whereareyou":"Western US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"Be prepared but also realize that sometimes there are questions/situations you can't prepare for. Always have a smile and be friendly :) ","rowNumber":142},{"timestamp":"3/17/2013 19:56:12","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"* Tell us about a time you had to take initiative on a project at work or school\n* what is the most interesting thing you've found while processing a collection?\n* what kinds of projects would you like to work on besides processing?\n* how involved would you like to be in professional organizations, particularly local organizations?\n* tell us about a mistake you've made at work, preferably one related to processing a collection\n* why would you consider leaving your current position for this one?\n* what do you think you will need to learn in order to do this job and how would you go about learning it?\n* tell us about any experience you have with exhibits and displays\n* What kind of situations do you find stressful?\n* give us an example of a time you built motivation in your coworkers or fellow students\n* After the backlog here is taken care of, what direction would you like to see this job take?\n* How does this position fit in the career path you've set for yourself?\n* Why do you want to work here at institution A? (typed from an sheet given to me which had the institution name)","whatquestionsdidyouasktheinterviewers":"honestly I don't remember","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Archives","jobfocuswascheckallthatapply":"Processing","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":143},{"timestamp":"6/4/2013 8:05:27","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1.\tWhat attracted you to this position and what personal strengths would you bring to the position?\n\n2.\tCan you tell us a bit more about your experience in access services areas?  Can you tell us a bit more about where you work now?  Are there distributed libraries? How many students, the size of the collections, etc.?\n\n3.\tMason is actively involved with many consortia. Have you had any experience representing your employer in such organizations? If so, please describe.\n\n4.\tHave you ever worked in a library where an established policy was viewed unfavorably by the library patrons?  If so, please tell us about the policy and your involvement with it.\n\n5.\tThis position supervises one librarian and two library staff members.  Can you tell us about any previous management experience you have? Can you give us a sense of the kind of approach you take to supervising?  (e.g., please describe your management style)\n\n6.\tHow would you describe the role of the Head of Access services? \n\n7.\tPlease tell us about a time where you had to correct a staff member’s performance/attitude.  What was the situation and how was it resolved?\n\n8.\tThis position will work closely with faculty and staff across several library departments.  Can you tell us about a situation where you successfully navigated across departments or worked on a project with colleagues from multiple departments on access related issues?\n\n9.\tWith which aspects of this job are you most confident? ","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Senior Librarian","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Public services","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":144},{"timestamp":"3/11/2013 16:49:00","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What do you like most about your current position?\nWhat do you like least?\nWhat is your experience with reference services?\nDescribe your typical day at your current job.","whatquestionsdidyouasktheinterviewers":"What is the work environment like?\n","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Reference","whereareyou":"Midwestern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"Answer the questions honestly - don't try to guess what they want to hear. I told the interviewers what I liked least about my current job was that it was so hectic that I didn't feel like I had enough time to devote my full self to any one aspect. When I asked them what the work environment was like, they told me it was super hectic because they were perpetually understaffed. I didn't make it to the second round of interviews, which was probably a good thing.","rowNumber":145},{"timestamp":"3/11/2013 19:28:20","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Tell us what brought you here.\n\nDiscuss a challenging situation with a patron, which ended positively.\n\nWhat kind of technology do you use in your day-to-day life?\n\nWhat makes you stand out if all the candidates look the same on paper?\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Reference","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":146},{"timestamp":"3/12/2013 8:56:27","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"How do you see public libraries in the future?\nName some of the databases in Ebsco.\nHow would you handle staff problems.\nHow would you handle a problem patron?","whatquestionsdidyouasktheinterviewers":"What is your current budget for materials?\nWhat types of programs are offered?\nWhat is the mission & vision of the library?","whatpositionlevelwasitfor":"Department Head","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Reference","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"I am in an urban area but the library system was located in a rural area.","rowNumber":147},{"timestamp":"3/13/2013 10:58:26","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1. Have you ever been involved in developing policies & procedures? \n2. If a young adult asked you to help them find information on how to make a bomb, what would you do? \n3. If a patron makes a complaint against certain materials you have on shelves, what would you do? \n4. Do you have any experience with mobile devices? ","whatquestionsdidyouasktheinterviewers":"1. Because the library had varied hours per department but I would be at the main desk, I asked for clarification of my hours. \n2. Although typically a \"desk\" job, if needed, can I assist with shelving or the circulation desk? \n3. Are there any questions that you asked that you'd like me to expand on? ","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Reference","whereareyou":"Western US","whereareyou_2":"Rural area","anyothercommentsformeorforyourfellowjobhunters":"* I had two phone interviews for two different libraries, both out of state. I was offered one, but had to turn it down because of the hours (way less than expected). Awaiting results of the other. ","rowNumber":148},{"timestamp":"3/13/2013 14:18:45","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1. Name your three favorite reference tools besides Google and the library catalog. \n2. What kinds of programming would you be interested in introducing to the library?\n3. Are you willing to teach a computer course to the public? \n","whatquestionsdidyouasktheinterviewers":"Pay rate","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Reference","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":149},{"timestamp":"5/1/2013 14:53:44","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"If you were at the reference desk and you were serving a patron, the phone was ringing, and another patron approached you insisting he would only take a minute of your time, what would you do?\nWhat would you do if someone was accessing pornography on a library computer and another patron complained?\nHow would you make recommendations for a reader who wanted to find more books like the Wheel of Time?","whatquestionsdidyouasktheinterviewers":"What are the demographics in your community like?\nIs there a high demand for foreign language materials?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Reference","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"Don't apply to public libraries unless you really want to work in public libraries.  They can smell lack of enthusiasm from 2000 miles away and from my limited experience service ethic is about 80% of what public librarians are looking for. \n\nI've also noticed a much higher likelihood of being asked questions about dealing with problem patrons from public librarians than from academic librarians.  Lots of \"how would you respond to difficult situation X\" questions. ","rowNumber":150},{"timestamp":"8/2/2013 20:28:39","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Special Library","jobfocuswascheckallthatapply":"Reference","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":151},{"timestamp":"10/10/2013 9:43:18","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"-How does your experience make you a good fit for this position?\n-Can you talk about one issue libraries have to face in order to remain relevant?\n-Have you ever had a problem with a co-worker and how did you resolve the problem?\n-Can you describe a time when you've solved an issue with a problem patron?\n-How would you handle juggling deadlines while faced with constant interruptions at the service desk?\n-What are your interests outside of work? / What kinds of books do you like to read?","whatquestionsdidyouasktheinterviewers":"-What is your favorite, and your least favorite, part about working here?\n-Questions related specifically to the job description","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Reference","whereareyou":"Northeastern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":152},{"timestamp":"10/12/2013 11:21:52","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Describe a good reference interview.\nWhat is information literacy and how does your work contribute to that?\nDescribe a time you successfully collaborated with an instructor.\nDiscuss your experience working with other library staff to provide reference service.","whatquestionsdidyouasktheinterviewers":"What is the projection for the remainder of the interview process?\nWhat are the top priority goals for these positions?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Reference","whereareyou":"East Coast US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"I'm an internal candidate; otherwise I would have had DOZENS of questions for the committee to choose from.","rowNumber":153},{"timestamp":"3/30/2013 7:56:37","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"-How will you contribute to this position? What are your strengths and weaknesses in terms of this position?\n\n-How has diversity influenced your career?\n\n-How will you interact with the other stakeholders? (something like that)\n\n-Tell us about a project where you worked in a team?\n\n-How does the library impact student services/what is the library's role?","whatquestionsdidyouasktheinterviewers":"This was a new position, so I asked about who had previously been responsible for the duties, and how this position would fit into the existing structure.\n\nThe school has more than 1 campus, so I asked about interaction/travel/projects between them.\n\nI also asked about the turnover rate for staff (I find that says a lot about an institution)","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Reference, administrative","whereareyou":"Northeastern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"I have had a bunch of interviews over the last year or two and the ones I feel confident going into always have the best results. Don't doubt yourself and be prepared. It never hurts if you can make your interviewers smile or laugh. \n\nAlso, trust your judgement. I was offered one position where the director & library seemed really off/unorganized and I declined the position. Later I learned no one stayed in that position for more than 6 months.  ","rowNumber":154},{"timestamp":"6/8/2013 11:13:37","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Tell us about yourself and your career goals.\nWhy are you interested in this position?\nWhat are the qualities of a successful manager? What is your management style?\nDescribe a difficult situation with a patron or coworker. How was the situation resolved? Is there anything you would do differently in retrospect?\nDescribe a specific situation where you smoothed the way for change in the library. Which actions were successful and which were unsuccessful?\nThe person in this position must be innovative and proactive. Give specific examples of times when you exhibited these qualities.\nShould exceptions to policy ever be made? If not, why?\nDescribe a time when you had multiple priorities. How did you handle them?\nTell us about a time when you had to make a difficult decision that would make some people unhappy no matter what you decided. How did you handle the situation?","whatquestionsdidyouasktheinterviewers":"Two specific questions about the position that referenced the job ad and job description.\nAre there specific projects you have in mind for the person in this position?\nWhat is the difference between a good [job title] and a great [job title]?","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Reference, Circulation","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":155},{"timestamp":"11/6/2013 18:05:26","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"How do you stay current?\nWhat makes you particularly qualified for this position?\nHow would you develop a relationship with faculty?\nWhat experience do you have providing reference to a multi-cultural student body and the general public?\nWhat do you think will have the highest learning curve for you?","whatquestionsdidyouasktheinterviewers":"Could you describe the reference model?\nHow closely do the library departments work together?\nQuestions about the budget (collection development position).\nAre there any concerns about my fit for the position?\nWhat are the expectations for tenure outside of the job duties?\nHow is the relationship with IT, is there a computer replacement schedule?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Reference, Collection Development","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":156},{"timestamp":"4/12/2013 10:47:03","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"- Tell us about a time you had to use your creativity to come up with an innovative solution to a problem. \n- Why are you interested in this position?\n- Can you walk us through your resume describing your experience with (crucial aspect of job)?\n- Where do you see yourself career-wise in 5 or 10 years?\n- Describe your experience with teamwork.\n- How do you handle stressful work environments and task prioritization on short deadlines?","whatquestionsdidyouasktheinterviewers":"- What kind of characteristics do you value in a colleague? \n- What are the main sources of stress in the workplace?\n","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Corporate library","jobfocuswascheckallthatapply":"Reference, Data curation","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":157},{"timestamp":"5/22/2013 14:02:53","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1. Why are you interested in this position?\n\n2. (Given a copy of the job description) Which of these job responsibilities are you most comfortable with--your strength--and which are you least comfortable with--your weakness?\n\n3. Think of a book you recently read and tell us about it as an informal, impromptu booktalk.\n\n4. How would you go about developing the teen collection?\n\n5. Describe when you have worked with a team.\n\n6. Describe how you have handled a difficult situation when working with other team members.\n\n7. Do you have experience with ereaders?\n\n8. How would you handle other staff who feel teens don't belong or are disruptive in the library?  \n\n9.  How would you handle a situation where a teen is being rowdy?\n\n10.  What would you do if you were working the reference desk and had to handle someone standing there in person asking for information, the phone is ringing, and a chat reference question pops up?\n\n11.  When was the last time you had to do public speaking?  Describe it.\n\n12.  Did you take any YA classes while completing your MLS?\n\n13.  Did you take any reference classes while completing your MLS?\n\n14.  How would you develop a relationship with the local schools?\n\n15. Think of a time when you've had to handle a big change.  How did you deal with?\n\nAt the end, I was given an \"assignment\" to complete before I left the library.  I had to come up with a program idea to get teen boys into the library.  I was given a sheet with the directions and had to respond (in writing) with the program title, description, and ways I would promote the program.  I think the idea behind this was to get a sense for how the candidate writes, not so much the programming idea.  In any case, this was a new one for me!  I've never had an assignment to complete before I left an interview!\n","whatquestionsdidyouasktheinterviewers":"1. Can you describe either the new or continuing goals/projects the library has for future?\n\n2.  Describe your experience working here.  Specifically, what surprised you the most when you started working here?  What do you like most and least about your job?\n\n3.  Why is this position open and how secure is the funding for continuation?\n\n4. What are some of the first tasks/projects that you would like to see the person in this job complete?  Also, what are the long-term objectives with this position?\n\n5. How supportive is the library for professional development? Do you offer funding for travel, etc.?\n\n6. What do you expect the biggest challenge will be for the person in this position?\n\n7. Would you describe the library as more team-driven or individual driven? How closely do the departments work together?\n\n8. Who is the supervisor of this position?  Could you describe your management and communication styles?\n\n9. How is one evaluated on the job?\n\n10. Is the schedule fixed or does it vary?\n\n11. What is your timeline for the search process and possible start date?\n\n12. Would it be possible to have a short tour of the library and/or workspace?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Reference, Teen Services","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"I brought along samples of book reviews and book talks I've written, a pathfinder, and even reference responses to share with the panel.  While I didn't get to yank out everything, I was able to pull out some things that I could work into my answers.  I think these really helped!!!  Also, I have an online portfolio (website)  that I included the link to in my cover letter and resume.  Having this strengthened my application and made it quick and easy to print off samples to bring to the interview.  I was contacted the day after my interview for a 2nd interview!!!  It all must have helped. :)","rowNumber":158},{"timestamp":"3/11/2013 15:31:13","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"What is your teaching philosophy?\nWhat is your approach to public services?\nHow would you recruit participants for focus groups, usability studies, etc.?\n","whatquestionsdidyouasktheinterviewers":"The position I was applying to was a new position, so I asked quite a few questions about how it would fit into the existing departmental structure.\nWould I have the opportunity to pursue other areas of professional interest (teaching, collection development, etc.)","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Reference, Web Services","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"Good luck!","rowNumber":159},{"timestamp":"3/22/2013 7:48:46","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Partnership working experience and ideas\nAwareness of developments and trends in public libraries\nExperience of working with diverse user base\nExamples of motivational, advocacy, leadership, teambuilding, organisational skills\n","whatquestionsdidyouasktheinterviewers":"The future of public IT access?\nThe future of digitisation and digital preservation in the organisation?\nOpportunities for feedback and future development action in case of failure","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Reference, Web Services","whereareyou":"UK","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"Examples, examples, examples.","rowNumber":160},{"timestamp":"4/18/2013 10:27:54","whatkindofinterviewwasit":"Supplemental application questions","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What is the most successful program or even you’ve planned? Why was it successful?\n\nDescribe a situation when you saw a need for improvement in a process or procedure. What did you do about it?\n\nTell us about a time you taught technology to a group or individual?\n\nWhy did you become a librarian ","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Technology Center","whereareyou":"Midwestern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":161},{"timestamp":"3/11/2013 13:29:45","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Tell us your qualifications and experience.\nWhat experience do you have with computers, hardware, software, etc?\nWhat makes you think you are the right person for this job?\nHow would you handle a discipline problem?\nA student comes in looking for information on China. How do you help them?\nWhat book are you currently reading? Or a variation was \"what is your favorite children's book?","whatquestionsdidyouasktheinterviewers":"Never ask about the pay or the hours, etc. You should already know about that.\nI don't recall if I asked them anything, but for sure you should thank everyone and get up and shake their hands (if you didn't already do that in the beginning).\nThank you notes and emails are nice, but often the interviewers make up their minds that day right after the last applicant. ","whatpositionlevelwasitfor":"Library Media Technician","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"Teen Services","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"*Smile!!! Since my interview I have sat in on many others and so many of the people never smile. People want to work with nice people, so show them that you are happy!\n*Share an example. When you are asked a question like, \"how would you handle an unruly child,\" give an example of how you dealt with it.\n*Be careful not to drone on and on about something. If they say you have 1 minute to answer, do not go over.\n*When they ask you that final question of if you have anything to add, make sure you have something memorable or fantastic to say. That is what they will remember. You can also volunteer information that shows how interesting you are. In one of my interviews for a teaching fellowship I told them about one of my classes at SJSLIS where I worked in a library for a month in the Middle East. It showed my love for travel and also the fact that I am willing to volunteer.","rowNumber":162},{"timestamp":"3/11/2013 21:17:25","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Teen Services","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":163},{"timestamp":"3/12/2013 11:50:01","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Application","whatquestionsdidtheyaskyou":"There were a lot of typical questions but these stood out for me because I wasn't sure what they wanted. If patrons are too difficult, I usually have supervisors, assistant director or director talk with them instead.\n\nWhat is your experience with difficult patrons? \nFor a young adult librarian job: how would you handle it if other staff members gave teens a hard time for talking in the library when they hadn't treated adult patrons the same way? ","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Teen Services","whereareyou":"Northeastern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":164},{"timestamp":"3/18/2013 11:14:51","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What interested you in this position? \nWhat teen books have you read that you'd recommend to a teen?\nHow would you deal with a teen who wasn't interested in reading? \nWhat is your experience with online databases? \nWhat strengths do you think you bring to a team? ","whatquestionsdidyouasktheinterviewers":"What is the typical work week?\nWhat strengths do you see the successful candidate bringing to the position? \nWhat percentage of \"other duties as assigned\" will make up the overall duties of the position? \nWhat is the next phase of the selection process? ","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Teen Services","whereareyou":"Mideastern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"After this interview I realized the interviewer seemed more nervous than I was, so it was a good reminder to stay cool and confident. ","rowNumber":165},{"timestamp":"3/22/2013 8:15:31","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First and only round","whatquestionsdidtheyaskyou":"What makes you angry?\nTypes and frequency of programs to run.\nForms of community outreach/partnering with local schools\nVarious ethical questions regarding access to print and digital materials. \n","whatquestionsdidyouasktheinterviewers":"What was their vision for the department going forward?\nHow did they feel about finding outside funding through grants? \nDid they have a plan to integrate more technology in the future?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Teen Services","whereareyou":"Northeastern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"The library world can be very small, so be respectful and constructive when speaking about other libraries and librarians. ","rowNumber":166},{"timestamp":"8/2/2013 9:00:22","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Third round","whatquestionsdidtheyaskyou":"If money were no object, what three items would you buy for the library?\nHow do you manage co-workers who may be older/have more experience than you?\nHow do you manage co-workers who are reluctant to change and reluctant to adopt new technologies?\nHow do you manage co-workers who do not respond to your emails? \nIf you were selected for this position, what would your first three months look like? What would your first six months look like?\nHow will you adjust moving from a large urban library system to a smaller, one library system?","whatquestionsdidyouasktheinterviewers":"What are some challenges might the person accepting this position face?\nIs this position welcomed by the staff?\nTell me about the people I would be managing? What do their daily tasks look like? Is there anything you would like to change about their job/title?\nWhat current outreach are you doing?\nWhat is your relationship with the surrounding library systems?\nWhere do you see yourself positioned in the community","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Teen Services","whereareyou":"Midwestern US","whereareyou_2":"College Town","anyothercommentsformeorforyourfellowjobhunters":"This job interview was grueling. I spent four hours at the library, including a half hour on their reference desk. I was quized many times about why I would want to leave my current position to have this position. ","rowNumber":167},{"timestamp":"8/2/2013 9:07:22","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"How do you engage reluctant teen male readers?\nIf offered this position, what would you like to do in your first year?\nHow do you stay organized?\nHow do you communicate with co-workers?\nWhat is your management style? What management style do you prefer from your manager?\nAs you would be the only person in this department, how would you manage tasks if you needed help? Who would you ask/enlist?","whatquestionsdidyouasktheinterviewers":"Where does this job fit within the structure of the library? What department manages this position?","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Teen Services","whereareyou":"Midwestern US","whereareyou_2":"Suburban area","anyothercommentsformeorforyourfellowjobhunters":"I was not offered a Skype/phone interview for this out-of-town interview. ","rowNumber":168},{"timestamp":"8/5/2013 17:20:43","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"If a 7 year old came up and asked you for a book about sex, what would you do? What 2 books would you use for a display of LGBTQ books for Pride Month and why? What would you bring to this position? What do you feel you could contribute that others could not? Talk about a time when you received constructive criticism and how did you use it to change the way you worked? What was the most interesting thing you learned about our community? Would you accept a facebook friend request from a teen patron? How separate do you keep your personal and professional social media? How do you maintain a supportive relationship with teens while keeping an appropriate amount of distance? Tell us about a YA book you read recently that you didn't like. (They had asked me about a YA book I read and did like in the phone interview) Tell us about a time when you chose not to enforce a policy? \n\nI was also asked to do an activity-- they gave me a bag of: 2 sheets of paper, 4 straws, 4 popsicle sticks, a paper clip, 2 rubber bands, some pipe cleaners (i think that was it) and a red bean bag and gave me 2 minutes to construct something that would hold the bean bag off the table. I am guessing it was to see how i reacted under a time pressure, how I approached a task, how I reacted with an unexpected challenge, that sort of thing. I thought it was fun and I did manage to do it! ","whatquestionsdidyouasktheinterviewers":"What do you feel the biggest challenges are for this position and for the library as a whole? Can you characterize the culture here, working with the patrons/community and also between co workers? Does this library concentrate more on team or individual work? Can you talk about living in __________? ","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Teen Services","whereareyou":"Midwestern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":169},{"timestamp":"4/18/2013 9:41:38","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Tell us your \"verbal resume.\"  What has led you to this point?\nWhat are your top three strengths?\nWhat is your biggest weakness?\nHow would you get involved in our school?\nAre you flexible?  Give an example.\nHow do you think technology influences our high school library program?\n","whatquestionsdidyouasktheinterviewers":"How does your budget work?\nDo you have fund raisers (elementary schools have \"book fairs\" to raise additional funds)?\nDo you have financial support from the IT department?\nWhat data bases do you subscribe to and does that come out of your regular budget?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Teen Services, High school Libararian","whereareyou":"Southern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"There were more questions but I can't remember all of them right now.  If I do remember, I'll post again!","rowNumber":170},{"timestamp":"3/18/2013 6:29:07","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What do you know about our organization?\nWhat changes would you make in the first 3 months, 6 months, 1 year?\nDo you have experience raising funds?\nAre you an entrepreneur?","whatquestionsdidyouasktheinterviewers":"You mention customer service five times in your job announcement and job description.  Is there a problem with customer service in your organization?","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Public Library Consortium","jobfocuswascheckallthatapply":"Web Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"I did not get the job.  Probably not a good follow-up question.","rowNumber":171},{"timestamp":"3/18/2013 6:29:07","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"What do you know about our organization?\nWhat changes would you make in the first 3 months, 6 months, 1 year?\nDo you have experience raising funds?\nAre you an entrepreneur?","whatquestionsdidyouasktheinterviewers":"You mention customer service five times in your job announcement and job description.  Is there a problem with customer service in your organization?","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Public Library Consortium","jobfocuswascheckallthatapply":"Web Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"I did not get the job.  Probably not a good follow-up question.","rowNumber":172},{"timestamp":"6/11/2013 9:25:02","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"\"So you can do mobile app development?\"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Web Services","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"Just try to anticipate curve ball questions. My interview turned on a dime because I do not have mobile app experience (you could actually hear the search committee chair sigh). This was not an explicit job requirement/ preference listed in the job announcement. ","rowNumber":173},{"timestamp":"3/11/2013 12:43:24","whatkindofinterviewwasit":"","whatlevelinterviewwasit":"","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"","whattypeoforganization":"","jobfocuswascheckallthatapply":"","whereareyou":"","whereareyou_2":"","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":174},{"timestamp":"3/11/2013 15:22:08","whatkindofinterviewwasit":"","whatlevelinterviewwasit":"","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"","whattypeoforganization":"","jobfocuswascheckallthatapply":"","whereareyou":"","whereareyou_2":"","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":175},{"timestamp":"3/13/2013 7:31:46","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"1.How a library functioning?\n2.What is a KPI (Key performance indicator) of Library?\n3. Why do you want to work in library?\n4. What is the data base for Mechanical engineering?\n\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"","whereareyou":"Singapore","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":176},{"timestamp":"3/17/2013 10:31:21","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Some of the questions included:\n* What other strengths do you have that we haven't addressed?\n* If you were in an elevator with a stranger, how would you describe what you do as an archivist/librarian?","whatquestionsdidyouasktheinterviewers":"Questions I asked included:\n*Most challenging aspect of the job?\n*How is professional development supported for this position?","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"","whereareyou":"","whereareyou_2":"","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":177},{"timestamp":"6/2/2013 8:54:07","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Library Assistant","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"","whereareyou":"India","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":178},{"timestamp":"6/4/2013 22:25:55","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Where do you see this library in ten years?\nWhat roll do you feel nonfiction takes in collection development?\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"School librarian","whattypeoforganization":"School Library","jobfocuswascheckallthatapply":"","whereareyou":"Western US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":179},{"timestamp":"8/7/2013 12:06:32","whatkindofinterviewwasit":"","whatlevelinterviewwasit":"","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"","whattypeoforganization":"","jobfocuswascheckallthatapply":"","whereareyou":"","whereareyou_2":"","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":180},{"timestamp":"9/8/2013 12:55:58","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Building a list/Initial screen","whatquestionsdidtheyaskyou":"1. How would you put together a team to explore building a Google+ page?\n2. How would you go about planning and creating a teen collection of controversial materials?\n3. How would you get 20-30 year old non library users to use the library?\n4. What would you tell a patron who wants to know whether to buy an eReader or a Tablet?","whatquestionsdidyouasktheinterviewers":"n/a - oral board","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"","whereareyou":"Western US","whereareyou_2":"county","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":181},{"timestamp":"10/12/2013 20:25:50","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"","whatquestionsdidtheyaskyou":"","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"","whattypeoforganization":"","jobfocuswascheckallthatapply":"","whereareyou":"","whereareyou_2":"","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":182},{"timestamp":"11/19/2013 13:17:28","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"Building a list/Initial screen","whatquestionsdidtheyaskyou":"What is your favorite gadget? \nWhere/how do you learn about new technologies? \nWhere would you research/purchase new technology/materials for the library? \nHow would you evaluate new technology? \nHave you planned and rub orphans from idea to execution before? \nHow many different uses can you think of for a paper clip? \n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Instruction, Programming, Web Services, emerging technologies","whereareyou":"Northeastern US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":183},{"timestamp":"11/20/2013 12:30:30","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"-Why am I a good fit for this position?\n-This position works with students (onsite and online), faculty, and community members.  How would you approach teaching?\n-What steps would you take to plan an exhibit at a senior center?\n-This is a tenured position. How would your research and professional development interests align with that?\n-Provide an example of teamwork.\n-Give an example of a time you received constructive feedback and what did you do with it?\n-What ideas do you have to promote the library with the university and the community?","whatquestionsdidyouasktheinterviewers":"Is the current position vacant?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Outreach, Reference","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":184},{"timestamp":"11/20/2013 12:42:13","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"-Why are you interested in this position?\n-What do you know about the Jesuit mission? What interests you about working in a small liberal arts environment?\n-What is your teaching philosophy on information literacy? Tool or problem based approach?\n-How do you keep abreast of current trends?\n-Develop collaboration with the English faculty. How would you approach teaching information literacy?\n[then there was a question about state consortiums and HATHI Trust that had nothing to do with the position]\n[then there was a question about it being a supervisory position]\n-Reference is evolving. How and where do you see reference being delivered?\n-This is a faculty position, with the highest premium on teaching.  What is your pedagogical style?","whatquestionsdidyouasktheinterviewers":"Is this a new position?\nIn the past 5 years, tell me about a project or innovative idea that you're proud of, or has been a success within the library.\nAny past challenges with liaising with the faculty for collection development?","whatpositionlevelwasitfor":"Supervisory","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Outreach, Reference","whereareyou":"Southern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":185},{"timestamp":"11/21/2013 9:42:00","whatkindofinterviewwasit":"Phone","whatlevelinterviewwasit":"Building a list/Initial screen","whatquestionsdidtheyaskyou":"The most interesting questions were:\n\nWhere do you see the future of academic libraries?\nWhere do you see the future of STEM?\nIs there anything about your experience you think we should know?\n\nI was also asked questions about my instruction and reference experience and collaborating with other departments. ","whatquestionsdidyouasktheinterviewers":"Why is the position open?\nWhat is your instruction philosophy? \nWhat are the opportunities for professional development? \nAre there any duties not listed in the advertisement that I'd be expected to fulfill?\nWhat are the next steps?\nWhat do you like about working at_____? ","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Instruction, Outreach, Reference","whereareyou":"Mid-Atlantic US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":186},{"timestamp":"12/10/2013 12:07:33","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"How would you promote diversity around campus?\n\nHow would you deal with a problem patron/conflict?\n\nHow would you respond to an emergency in the library?\n\nWhat type of technology do you use and are you familiar with?\n\nHow would you develop a collection?\n\nIf you are at the reference desk and a student asks a technology question, how would you respond?\n\nWhy this college? What is the role of the librarian in the community college? What are your skills how do they pertain to the job?\n\nWhat are your experiences with SLOs?\n\nWhat is your experience with teaching information literacy?\n\nDo you have anything further to say about yourself or have any questions for us?\n","whatquestionsdidyouasktheinterviewers":"","whatpositionlevelwasitfor":"Two or more years of experience","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"","whereareyou":"Western US","whereareyou_2":"City/town","anyothercommentsformeorforyourfellowjobhunters":"practice makes perfect... the more you do the better you will be.","rowNumber":187},{"timestamp":"12/12/2013 12:09:19","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"-What's your favourite part of R.A.D. (Rules for Archival Description)?\n-How would you effectively teach senior volunteers new technology?\n-How would you address or liaise between various levels of institutions?\n-Why did I chose this feild of study? Why did I chose the universities attended?\n-What's the relationship between Records Management and Archives?\n-Give us an example of a time when you had to communicate something and wished you'd done it differently.","whatquestionsdidyouasktheinterviewers":"-Asked about recent budget cuts\n-Asked about current or upcoming projects","whatpositionlevelwasitfor":"Archives Advisor","whattypeoforganization":"Council of Archives","jobfocuswascheckallthatapply":"Adult Services, Instruction, Outreach, Programming, Reference, Archives","whereareyou":"Canada","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":188},{"timestamp":"12/12/2013 12:10:19","whatkindofinterviewwasit":"In-person","whatlevelinterviewwasit":"First round","whatquestionsdidtheyaskyou":"Describe a time where you noticed something before it became a big problem and what you did to correct it.\nDescribe how you communicate with other employees on a day-to-day basis.\nHow do you maintain a healthy relationship with your coworkers?\nImagine a patron came up with an unreasonable request. What would that request be and how would you handle it?","whatquestionsdidyouasktheinterviewers":"What do the different circulation specialists do?\nAre there any changes coming in the department?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Academic Library","jobfocuswascheckallthatapply":"Circulation","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"","rowNumber":189},{"timestamp":"12/12/2013 13:01:05","whatkindofinterviewwasit":"Skype/Video Chat","whatlevelinterviewwasit":"Second round","whatquestionsdidtheyaskyou":"What kind of co-workers do you like working with?\n\nHave you ever had any experience interacting with a belligerent customer?\n\nWhy are you thinking of moving here [thousands of miles away]?\n\nDo you have experience with collection development, specific vendors?\n\nWhy did you want to become a librarian?\n\nTell me about your experience working with pre-k children, specifically.\n\n","whatquestionsdidyouasktheinterviewers":"Do you have bilingual storytimes? \n\nWhat is the supervisory structure? Who would be my immediate boss?\n\nDo you have toys in the chidren's section, like trains?","whatpositionlevelwasitfor":"Entry level","whattypeoforganization":"Public Library","jobfocuswascheckallthatapply":"Children’s Services","whereareyou":"Northeastern US","whereareyou_2":"Urban area","anyothercommentsformeorforyourfellowjobhunters":"I am in New York City, but the job was in Texas.","rowNumber":190}]